[
  {
    "id": "53163",
    "name": "Aca-Sound",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/asound/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "Aca-Sound runs sound (speakers, mics, mixing, etc) for MIT's student acapella groups.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53299",
    "name": "Acroyoga",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2487140_MIT_AcroYoga_Logo_56151440.png",
    "website_url": "https://engage.mit.edu/Ayoga/",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "At MIT Acroyoga, our mission is to unite the MIT community through the dynamic and joyful practice of acroyoga. We provide regular classes, practice sessions, and events in a safe, welcoming space where acrobatics meets yoga, and everyone meets fun! Join us to explore the blend of strength, balance, and flexibility, and foster mental well-being and healthy communication through this exciting group-oriented activity. Everyone is welcome, and no experience is necessary—let’s fly together!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": null,
    "name": "Addir Interfaith Engagement Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://addir.mit.edu/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The Purpose of the Addir Interfaith Engagement Association is to promote greater harmony, connection and empathy across the full spectrum of religious, spiritual and philosophical identities within the MIT community and in the world beyond. The word 'addir' is an ancient Sumerian word for bridge, and Addir seeks to build bridges both between individuals who orient around religion differently and between different religious, spiritual and philosophical communities. Addir seeks to promote a council of cooperation, learning, and growth amongst the various religious and secular groups on MIT’s campus. Addir encourages increased understanding of all religious and secular worldviews in the MIT community through an Interfaith Dialogue Fellowship, open events, campaigns and initiatives across campus.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53399",
    "name": "Afghans@MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Afghans/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Afghans@MIT aims to cultivate a vibrant and inclusive community for Afghan students and those interested in the rich and diverse culture of Afghanistan. The organization is dedicated to celebrating heritage, promoting cultural awareness, and supporting academic and professional growth through networking, mentorship, and meaningful dialogue. A key focus is fostering academic engagement and student-led research and technology initiatives by building connections between MIT students and Afghan and diaspora scholars. Additionally, the group aims to address educational and technological needs by supporting Afghanistan’s academic institutions and innovation ecosystem through knowledge-sharing and collaborative projects. By engaging with the broader MIT community, Afghans@MIT strives to create a platform for cultural exchange, advocacy, and impactful initiatives that contribute to the collective growth of MIT, Afghanistan, and its global diaspora.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52999",
    "name": "African Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://africans.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "We aim to provide a learning environment for anything African related; to increase awareness about Africa and Africans among MIT students; showcase the various aspect of the African culture such as ways of life, food, music, and clothing; to assist new MIT members in adjusting to the MIT lifestyle, and to present Africa from the African perspective.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53298",
    "name": "Allied Scholars for Animal Protection",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/ASAP/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "Vegan@MIT strives to make the world a better place for human and non-human animals by providing education and events surrounding the vegan, plant-based lifestyle.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52609",
    "name": "Alpha Omega  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MITAO/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Our goal is to provide a space for spiritual discussion, introduction, and community to college students/affiliates, focusing specifically on the Bible and  Christianity. We offer students deep connections and support with other interested students, even across universities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52612",
    "name": "American Indian Science and Engineering Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2600336_aises_logo_reduced_41931159.png",
    "website_url": "http://mit.edu/aises",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT's AISES chapter supports the mission of the national, nonprofit organization focused on substantially increasing the representation of American Indians, Alaska Natives, Native Hawaiians, Pacific Islanders, First Nations and other indigenous peoples of North America in science, technology, engineering and math (STEM) studies and careers.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53307",
    "name": "American Institute of Aeronautics and Astronautics MIT Chapter",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/AIAAMIT/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "AIAA is a voice to the undergraduate course 16 department and community, provides sanity and happiness (study breaks/parties), supports student career and education through professional development, and encourages first year students to join the community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52614",
    "name": "American Institute of Chemical Engineers Student Chapter  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://aiche.scripts.mit.edu/index.html",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to support, benefit, and advocate for the chemical engineering undergraduate community at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52615",
    "name": "American Nuclear Society",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://ans.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Student Section of the American Nuclear Society (MIT ANS) is to promote the advancement of nuclear science and engineering as well as related disciplines.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52616",
    "name": "American Red Cross Team And Network of MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/arctan/www/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "ARCTAN, or the American Red Cross Team And Network, is the official liaison between theAmerican Red Cross and the MIT community. Operating in cooperation with the MassachusettsBay chapter of the American Red Cross, ARCTAN runs blood drives, raises funds, teaches CPRand first aid, and provides volunteers for disaster relief and food pantry activities. ARCTAN isrun by MIT students, and its members are MIT students, staff, alumni and affiliates.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52617",
    "name": "American Sign Language and Deaf Culture Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://github.mit.edu/goretkin/mitasl-constitution/blob/master/constitution.md",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the American Sign Language and Deaf Culture Club is to enable gathering of members of the MIT community with a shared interest in American Sign Language and Deaf Culture",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53015",
    "name": "Amphibious Achievement",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2501546_Amphibious_Achievement_Logo_914171836.png",
    "website_url": "http://amphibious.mit.edu/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "To inspire personal growth and a passion for learning in high schoolers through athletic and academic mentorship and hands-on learningAmphibious Achievement is dedicated to inspiring personal growth and a love for learning in under-resourced high schoolers in the local area. By combining athletic and academic mentorship with hands-on learning across a variety of subjects, Amphibious Achievement aims to bring opportunities to students, with the values of SWAG, determination, commitment, confidence, and we got each other, at its core.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53000",
    "name": "Anime Club  MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2470215_mitanime_logo_914172819.png",
    "website_url": "https://anime.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Anime Club is a non-profit MIT student organization dedicated to increasing the awareness of Japanese animation (anime) on campus.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53370",
    "name": "AppDev@MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2612965_Logo_Square_93105827.png",
    "website_url": "https://www.mitappdev.com/",
    "categories": ["Academic and Pre-Professional", "Education", "Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to build web and mobile applications with the goal of:1) Serving students, campus groups, and local businesses and organizations.2) Fostering practical skills in software development, product management, design, and marketing.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52618",
    "name": "Arab Student Organization",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2600399_Colored_1030171650.png",
    "website_url": "http://arab.mit.edu",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Arab Students’ Organization is to foster an Arab community on campus and give Arab students a space where they can be immersed in their culture as well as have a chance to share it with others in an inclusive way. The ASO strives to build bridges between MIT and the Arab world and provide opportunities for members to grow professionally, socially, and through service to the community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53322",
    "name": "Arabic Debate Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/ADC/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Arabic Debate Club is a student group focused on Arabic debate and public speech. We organize training sessions to prepare MIT students to participate in Arabic Debate Competitions throughout the year. The MIT ADC aims to encourage intellectual exchange and good communication in Arabic.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52620",
    "name": "Armenian Society  MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2482410_logohorizontal_54172135.png",
    "website_url": "https://www.mitas.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Massachusetts Institute of Technology Armenian Society (MITAS) is a club of Armenian students and scholars, which aims at creating a welcoming community to preserve and develop ties with Armenia and the Armenian community in Greater Boston Area. We organize multiple cultural events every semester ranging from casual mixers with Armenian students and community members from MIT and other schools in the area to cultural shows, exhibits and panel discussions.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52622",
    "name": "Artificial Intelligence Club at MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2499445_aimlogo_1124165425.png",
    "website_url": "http://aiclub.mit.edu/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "The Artificial Intelligence Club @ MIT is an organization focused on fostering and promoting machine learning education, projects, and research on the campus of the Massachusetts Institute of Technology.Our primary goal is to provide opportunities for students to learn about machine intelligence in a community environment. Our secondary goal is to increase interdepartmental and multi-university interaction relevant to machine intelligence — to bring those interested in machine intelligence closer together.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52623",
    "name": "ASHRAE MIT Student Chapter",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/ashrae/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the ASHRAE MIT Student Chapter is exclusively scientific and educational and includes, but is not limited to :a) The advancement of the sciences of heating, refrigerating and air conditioning engineering and related sciences;b) The continuing education of the members and other interested persons in said sciences, through lectures, demonstrations, conferences, and publications;c) The rendition of career guidance to students of the sciences; andd) The encouragement of sound scientific research.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52624",
    "name": "Asian American Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2517255_438231373_385379221140189_4164811439726395612_njpg_42301541.jpeg",
    "website_url": "http://asians.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Our missions are:To enrich campus life by contributing to an understanding of the Asian American experience.To foster an understanding of the diversity of Asian cultures.To promote awareness of Asian American issues and concerns.To protect Asian American interests by working as a pan-ethnic group.To provide opportunities for the development of leadership and communication skills.To become a service to the community.To encourage Asian American students to take pride in their heritage and identity.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52625",
    "name": "Asian Baptist Student Koinonia",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2515769_abskmit_56235237.jpeg",
    "website_url": "http://www.mit.edu/activities/absk/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "We are Asian Baptist Student Koinonia, a Christian fellowship at MIT composed of students who seek to know and love Jesus Christ through a life shared with Him and each other.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53103",
    "name": "Asian Baptist Student Koinonia Graduate Division",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/abskgrad",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Asian Baptist Student Koinonia Graduate Division is a group of graduate students joined together in our Lord Jesus Christ, each having a personal relationship with God, and therefore fellowship, or \"koinonia\", with each other. We have Bible Studies and other fellowship activities throughout the year to help members grow in their faith and build Christ-centered relationships.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53043",
    "name": "Asian Christian Fellowship",
    "logo_url": "https://engage.mit.edu/upload/mit/2021/s2_image_upload_2477221_66624B6FD3564F1FA2277BBF888309E6_822133736.jpeg",
    "website_url": "http://acf.mit.edu",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "We’re seeking to be a family where every student at MIT can experience the transformative love of God, a family that’s intentionally seeking God and investing in one another.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53148",
    "name": "Asian Club  MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2477236_ACF_logojpg_1010184636.jpeg",
    "website_url": "https://asianclub.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Asian Club and MIT Career Fair (ACF) is an official recruiting event at MIT in spring that aims to establish interactive and efficient conversations between Asia based employers and young talents in the U.S. We recognize the value of a thriving regional market in Asia, and students’ growing demand for direct involvement with professional development there. Using MIT as a platform to connect leaders from wide array of industries with ambitious students at MIT, Harvard, and other U.S. universities in the Northeastern area, we hope that the MIT Asian Club will be a successful platform that propels the professional growth of the students and the future development of participating companies.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52626",
    "name": "Asian Dance Team  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://adt.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Asian Dance Team (ADT), established in 2009, is a student organization dedicated to promoting and representing Pan-Asian culture and dance, ranging from modern Asian pop to contemporary works.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53033",
    "name": "Assassins Guild  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/~assassin",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "We are the MIT Assassins Guild, the LARP and nerf gun focused club at MIT! Join us to spend your day (or week) having a blast! The purpose of the Guild is to sponsor real-time, real-space roleplaying games known as Assassin Games, and real-time, real-space simulated combat.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53309",
    "name": "Assistive Technology Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/AssistTech/",
    "categories": [],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to make the world more accessible to everyone by building connections within our community and fostering collaborative efforts to create inclusive technology. Through AT@MIT, we introduce students to the fun (and challenging) design space of assistive technology while building connections between community members, engineers, and designers. We hope to inspire participants to pursue projects in the AT space in the future.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52628",
    "name": "Association of Computational Science and Engineering Students",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://acses.mit.edu/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of ACSES is to: facilitate social bonding among students in CDO, CSE and other computation-related programs, offer a platform for students to gather and discuss ongoing research and popular computational science and engineering topics, and to promote the CDO/CSE programs to more students and scholars who are interested in computational science and engineering.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52629",
    "name": "Association of Indonesian Students at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/AIS/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The AIS-MIT shall serve as a focus at MIT for all students, as well as other members of the MIT community, interested in Indonesia culture and affairs. The AIS-MIT shall also be active in organizing activities aimed at fostering interaction among the Indonesian community and introducing Indonesia and its culture to the rest of MIT community as well as those outside MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52630",
    "name": "Association of Puerto Rican Students",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_logo_52630_43173315.jpg",
    "website_url": "http://apr.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of this organization is to further the following objectives:- To improve the quality of life for all Puerto Rican students at the Massachusetts Institute of Technology.- To promote Puerto Rican culture through social and cultural activities.- To increase the enrollment of Puerto Rican Students at MIT through active recruitments at MIT, at our homes, or whenever the opportunity arises to bring students to MIT.- To work in solidarity with other minority student groups or any other group which seeks our support.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52632",
    "name": "Association of Taiwanese Students  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://ats.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT ATS aims to bring Taiwanese food and culture to the broader MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52964",
    "name": "Asymptones",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://asymptones.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "We are MIT's low-time-commitment a cappella group with a focus on fun and nerdy music. We are dedicated to being a lower-time commitment option (with three and a half hours of rehearsal a week instead of six) in order to help members balance a cappella singing with classes and other activities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53241",
    "name": "Australia and New Zealand Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://anz.scripts.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Australia and New Zealand Club (ANZ) is to foster connections between Australian and New Zealand students at MIT, while hosting events for the wider MIT community interested in Australian and New Zealander culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53104",
    "name": "Bahai Association  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://bahai.mit.edu/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to foster a vibrant community based on the principles of the Bahá'í Faith, promoting unity, equality, and peace. We aim to provide a welcoming space for spiritual growth, learning, and the development of moral and ethical standards. Through dialogue, service, and friendship, we seek to contribute positively to our campus and the wider community, embodying the Bahá'í teachings of oneness and harmony.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53074",
    "name": "Ballroom Dance Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/bdclub/index.html",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Ballroom Dance Club is an organization bringing together MIT community members with a passion for social ballroom dancing. Through our events, we strive to offer opportunities for our members to learn how to dance and to socialize with other attendees sharing a passion for dancing.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53075",
    "name": "Ballroom Dance Team  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://ballroom.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "We are the MIT Ballroom Dance Team, an organization of MIT students and affiliates who love competitive ballroom dancing. We help our members improve their dancing technique and support their participation in ballroom dance competitions. We encourage anyone in the MIT community to join us as long as you have an interest in competitive ballroom dance, whether you have any dance experience or not.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53081",
    "name": "Bangladeshi Students",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Bangladeshi/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Welcome to the Bangladeshi Student Association at MIT, where we foster a vibrant community of students dedicated to celebrating and promoting Bangladeshi culture, heritage, and identity. Our mission is to provide a supportive and inclusive space for Bangladeshi students at MIT, as well as those interested in Bangladeshi culture, to come together, connect, and engage in meaningful dialogue and activities.We strive to organize events and initiatives that showcase the rich tapestry of Bangladeshi traditions, including cultural festivals, language classes, and culinary experiences. Through these activities, we aim to increase awareness and appreciation of Bangladeshi culture among the MIT community and beyond.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52634",
    "name": "Baptist Student Fellowship",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2501853_BSFLogoColor1_914172224.png",
    "website_url": "http://bsf.mit.edu/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The Baptist Student Fellowship is an officially recognized student group at the Massachusetts Institute of Technology. BSF is an interdenominational Christian group of students started by baptists long ago. We are dedicated to providing fellowship, support, and food (physical & spiritual!) for our members to grow in knowing Jesus Christ. We are a place for undergrads, graduate students, or others studying at MIT to encounter God, discuss the Bible, grow in faith with one another and to help connect with local churches. BSF is a student run organization with support from the Baptist Chaplain and staff.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52635",
    "name": "Battlecode",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://battlecode.org/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Battlecode, MIT's premier programming competition, is to give students the opportunity to learn about the basics of strategy/game theory and programming, as well as good coding practices, and apply the knowledge that they have learned to competition. Competitors in Battlecode have a chance to play scrimmages and tournaments against other teams, network with sponsors, and win prizes.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52965",
    "name": "Bhangra Club  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://bhangra.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "America’s oldest collegiate Bhangra team, we are a group of individuals from MIT and the Boston area who love bhangra and are dedicated to exhibiting the energy and excitement that comes with it! Since our humble beginnings in 1991, we have always stayed passionate to our mission of spreading and sharing the bhangra lifestyle.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52637",
    "name": "Biology Undergraduate Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://mit.edu/busa",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of this organization is to further the following objectives:To bring together MIT undergraduates who are interested in learning about and discussing biology.To connect MIT undergraduates interested in biology with faculty in the biology department.To conduct outreach in the community by sharing the biology knowledge of MIT undergraduates through teaching programs at local schools and other community organizations.To represent the biology department at events such as CPW, Orientation, and Activities Midway.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52638",
    "name": "BioMakers Group",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/BMG/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT BioMakers Group (BMG) was created to inspire biomaking within the MIT community by fostering interdisciplinary collaboration, hands-on research, and a strong maker culture in the biological and chemical sciences. Through our dedicated Huang-Hobbs BioMakerSpace, we provide students with the tools, space, and support to develop their own projects, gain essential lab skills, and grow within a passionate, inclusive community. By hosting workshops, speaker events, classes, and collaborative initiatives, BMG empowers students to learn, create, and contribute to a growing network of bio makerspaces across university campuses.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52639",
    "name": "Biotechnology Group  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://biotech.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Biotechnology Group aims to provide MIT community members from all backgrounds with the knowledge and resources to become future leaders in biotech. We strive to cultivate innovation, nurture collaborative relationships with industry leaders, and increase diversity within the Boston-Cambridge life sciences ecosystem.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52640",
    "name": "Bitcoin Club  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://bitcoin.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Bitcoin Club is to provide a forum where Bitcoin-related ideas, projects, programs, events, and businesses can be studied, discussed, and developed. Through club activities, we seek to increase awareness and use of Bitcoin within and beyond the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52641",
    "name": "Black Graduate Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://bgsa.mit.edu",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the BGSA is to cultivate community and provide a safe space of Black students across MIT. Our activities fall along the lines of social events, political events, and cultural events.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52642",
    "name": "Black Students' Union",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/BSU/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of this organization is to provide support for Black students and to promote social interactions between students, faculty, staff, and alumni. The organization shall also aid in efforts to improve the welfare of the Black community at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52643",
    "name": "Black Women's Alliance",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://bwa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Black Women's Alliance's Mission is as follows:To provide a forum to address the needs and concerns of black female and non-binary undergraduate students at MIT;To promote the awareness of black female-aligned issues in the MIT community through activities designed to increase the visibility of black women on campus;To encourage interaction with other campus groups;To encourage the scholarship of black women and non-binary people at MIT; andTo promote activism, unity, allyship, friendship, and community andTo promote inclusivity across all genders and sexual identities within BWA and on MIT’s campus",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52645",
    "name": "Borderline",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2491302_Borderline_LOGO_41223335.png",
    "website_url": "https://engage.mit.edu/Borderline/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The Borderline began as a project to cover the 200 foot long wall in the tunnels under the campus of MIT. The tunnel is a commonly used route between MIT Buildings 66 and E17 during bad weather; it is a useful connection to get from point A to point B, but Borderline aimed to make it a destination through art and technology.In the spring of 2017, over 25 MIT-affiliated artists started painting murals in the tunnels. Since then, Borderline has expanded to over 65 murals in the tunnels and Banana Lounge (26-110) on campus. More murals and animations are being added every semester.Beyond the tunnels, Borderline has collaborated on projects with numerous organizations, such as the Museum of Fine Arts in Boston and Porto Seguro Cultural Center in São Paulo, Brazil. Borderline has been featured in The Boston Globe, VICE Motherboard, and other publications.The magic of Borderline comes in the form of augmented reality via the Artivive app, available for Android and iOS. Simply point your phone camera at the AR-enabled murals to unearth hidden animations!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53379",
    "name": "BR@MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/BRMIT/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the BR@MIT is to disseminate Brazilian culture through the MIT community and promote events that stimulate cultural awareness. Additionally we hope to serve as a bridge between MIT and Brazilian students who would like to know more about MIT life and the application process.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52647",
    "name": "Brain and Cognitive Sciences Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2470676_bcss_logo_97171729.png",
    "website_url": "http://bcss.scripts.mit.edu/www/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Brain and Cognitive Sciences Society is to serve as the official undergraduate association for MIT students majoring or minoring in Brain and Cognitive Sciences (Course 9 and 6-9). This includes providing academic information and career-related resources such as Course 9 and 6-9 classes and requirements, graduate school options, career development strategies and MIT resources as a whole; additionally, the group strives to be a source of communication between undergraduates and other members of BCS community such as M-eng students, PhDs, and faculty.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53016",
    "name": "Brain Trust",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2477624_BT_image_97171852.png",
    "website_url": "https://braintrustsite.wordpress.com/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT BrainTrust is one of the founding chapters of Synapse, a national organization composed of student-run service organizations whose primary aim is to serve local individuals with brain injury and other brain-related conditions. To support these individuals, we organize a variety of events such as social gatherings (ex: trips to the Museum of Fine Arts, picnics at MIT) and technology help sessions. We also have a unique buddy program, where we directly pair students and individuals with brain injury in order to provide these individuals with further guidance, immediate advice, and friendship. In addition to supporting local individuals with brain injury, we also strive to educate the community about brain-related disorders through panel lectures featuring physicians, researchers, and patients; brain injury discussion panels; and brain injury awareness booths.Through these initiatives, we hope to provide real-world opportunities to students and the greater MIT community interested in topics such as cognitive science, healthcare, medicine, assistive technology, and cognitive/neurological prosthetics. BrainTrust helps our student members expand their understanding of the patient side of many neurological conditions and also learn about new technologies being developed in the healthcare field.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53105",
    "name": "Buddhist Students Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2599159_Shamdrawingjpg_103017182.jpeg",
    "website_url": "http://prajnopaya.mit.edu",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "We provide an engaging platform for students to explore Buddhist philosophy and meditation practices. Open to all levels of practice and previous engagement with religion, ethics, and spirituality.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53083",
    "name": "Bulgarian Club at MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2492675_bg_club_logo_82515309.jpeg",
    "website_url": "http://www.mit.edu/~bg-club/index.shtml",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Bulgarian Club is a non-profit organization of students at the Massachusetts Institute of Technology, centered around celebrating Bulgarian culture and traditions.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52660",
    "name": "Camp Kesem MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/CKMIT/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Camp Kesem at MIT is to support children through and beyond their parent's cancer. CK MIT counselors are dedicated to serving our 200+ campers both at camp and throughout the school year, and fostering a place where they can feel safe, loved, and respected within a community of peers facing similar challenges.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52662",
    "name": "Campus Crusade for Cthulhu  MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/cthulhu/www/MITCCCth-Welcome.html",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The Campus Crusade for Cthulhu serves to  informal social and literary interest group, rather than a religious group, surrounding the Cthulhu mythos and the literary works of H. P. Lovecraft,et. al.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53290",
    "name": "Campus Hope",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2612935_square_422154746.png",
    "website_url": "https://engage.mit.edu/Hope/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Campus Hope seeks to connect Seventh-Day Adventist students through fellowship, worship, service, and spiritual growth during their time at university.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53084",
    "name": "Canadians Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2496717_MIT_CANADIANS_CLUB_LOGO_preferredsvg_1030172229.jpeg",
    "website_url": "http://web.mit.edu/canadians/www/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "We bring together the Canadian community at MIT.From hosting social events, supporting Canadians, to creating professional connections -- we help Canadians in Cambridge/Boston change the world.---From our humble beginnings as a \"mom and pop” type operation to hosting the largest gatherings of Canadians in Boston, the MIT Canadians Club has been in operation as early as 1991 to support fellow Canadians and Friends of Canada! Over the years we have sponsored the undefeated Canadian Hockey Teams (such as the Loonies), spreading Canadian delicacies such as Poutine, Nanaimo bars, and Timmies to all comers, meeting with 3+ generations of Consul Generals, and more in efforts to make Cambridge feel a little more like home. These days, we ambitiously strive to provide the best social events, supports, and professional connections for Canadians at MIT and other local area schools.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52966",
    "name": "Casino Rueda",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MCR/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "To teach and share the Cuban dance style Casino Rueda",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52991",
    "name": "Caving Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/spelunk/www",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of this organization is to promote exploration and generation of caves, tunnels, nooks, crannies, and other confined spaces within and without the Institute.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52967",
    "name": "Cello World",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599999_logo_510212321.png",
    "website_url": "https://engage.mit.edu/CelloWorld/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Cello World is to foster a community among cello enthusiasts at MIT by maintaining a cello ensemble that practices and performs repertoire as well as providing a space to casually play cello pieces.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53377",
    "name": "Central American and Caribbean Friendship & Engagement",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/CAFE/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Central American and Caribbean Friendship & Engagement club acts as a way of unifying all MIT Affiliates with Central American and/or Caribbean roots. We also seek to connect any member of the MIT community to Central American and Caribbean cultures by hosting events and creating a network of alumni. Additionally, we plan on supporting the MIT application process of talented Central American and Caribbean students, and ease the transition of newly admitted students into MIT culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53381",
    "name": "Central Asian Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MITCAA/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "We aim to create a welcoming community for everyone interested in Central Asian history and to foster a Central Asian community within Boston. The group will give a space for interested students to delve deep into several cultures including, Kazakh, Uzbek, Kyrgyz, Tajik, Turkmen, Uyghur and other central asian nations, while exchanging experience from several countries and regions in an inclusive way.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52664",
    "name": "Centrifugues",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2466991_FuguesLogo_1011758.png",
    "website_url": "http://centrifugues.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of The MIT Centrifugues is to perform mashups of pop, classic rock, and R&B songs, whereby the primary instrument shall be the human voice.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52665",
    "name": "Chabad Student Group",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/chabad/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Predicated on the Mitzvah of “V’Ahavta L’Re’a’cha Kamocha – love your neighbor as yourself,” we seek to foster a sense of Jewish identity and belonging by engaging Jewish students at their own pace and comfort level in a warm and non-judgmental environment, and by offering innovative educational programs in all areas of Jewish life.Chabad seeks to be a home away from home for every Jew on campus. We offer a wealth of social, educational and spiritual programs for the entire Jewish community at MIT. At college, students are exposed to new ideas and experiences; Chabad seeks to ensure that students graduate as stronger and more empowered Jews.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52667",
    "name": "Chemistry Graduate Student Committee",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://cgsc.mit.edu/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The Chemistry Graduate Student Committee exists to represent, serve, support, and advocate for graduate students in Chemistry at MIT. Our goals include providing social events, career development, networking, personal and professional support, and community for graduate students of all levels across chemistry disciplines. We aim to provide these things in a welcoming and inclusive community dedicated to all students in the Chemistry department.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52902",
    "name": "Chess Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/chess/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission at the MIT Chess Club is to cultivate a vibrant community where chess enthusiasts of all levels can come together to learn, practice, and compete in a friendly and supportive environment. We are dedicated to fostering an appreciation for the game of chess and promoting a deeper understanding of its strategic complexities. Through our activities and events, we aim to build a diverse and inclusive community at MIT, united by our shared passion for chess.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53361",
    "name": "Chi Alpha Christian Fellowship",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2515705_Chi_Alpha_Logo_Cropped_830132625.png",
    "website_url": "https://mitxa.org/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT students passionately following Jesus Christ.Rooted in the Bible and empowered by the Holy Spirit, we gather weekly for worship, study, and fellowship. We believe in building authentic relationships where we love and support each other as we draw closer to God and live for Him at MIT. Whether through our Family Nights, Regroups, or community events, we’re here to walk this journey together.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52669",
    "name": "China Innovation and Entrepreneurship Forum",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2606619_logocopy2_103104351.png",
    "website_url": "http://www.mitchief.org/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The \"MIT China Innovation and Entrepreneurship Forum (MIT-CHIEF)\" was established by Chinese international students at MIT and dates back to 2011, making it the longest-running Chinese innovation and entrepreneurship forum organized by college students in North America. Every year, the forum invites top scientists, entrepreneurs, and investors to discuss the challenges, trends, and outlooks faced during the processes of technological innovation and commercialization.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52670",
    "name": "Chinese Entrepreneurs Organization",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.mitceo.org/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT CEO was founded to help members to build world-class companies, to create a sustained collaboration mechanism between high-tech communities and large corporations across China and the U.S., and to help efficiently connect esteemed investors with high quality startups around the Greater Boston area.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52671",
    "name": "Chinese Students and Scholars Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2491988_CSSA_LogoJPG_97172030.jpeg",
    "website_url": "http://cssa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of MIT CSSA is to support its members on the pursuit of academic and socialachievements at MIT and to promote the Chinese culture to the rest of the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53002",
    "name": "Chinese Students Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://mitcsc.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Founded in 1916, we're the oldest cultural club at MIT. Throughout the years we've continued to be a hub for people who like Chinese-American culture, good food, and good company. If you also like these, check out our many events!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52968",
    "name": "Chorallaries of MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://choral.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to enrich the MIT commitment through acapella, in the form of performances for official Institute events, gigs for clubs and other groups, and semesterly concerts free of charge to the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53044",
    "name": "Christians on Campus",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/christians",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Christians on Campus is an ASA recognized student group of MIT. We love the Lord Jesus and endeavor to give Him the \"first place in all things\" (Col. 1:18). We meet together on campus, in homes, and in other settings to encourage one another, receive nourishment from the Bible and grow in Christ. We desire and seek that all our fellow students would come to know Christ as God and Savior. Christians on Campus also endeavors to help all Christians to build the Church, the Body of Christ, according to the Lord's desire as revealed in the Holy Word. We hold the faith which is common to all believers regarding our salvation. We receive all believers in Christ and encourage all others to believe into Christ.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52674",
    "name": "Civil and Environmental Engineering Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://cee.mit.edu/education/undergraduate/undergraduate-student-life/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The Civil and Environmental Engineering Students Association (CEESA) is the American Society of Civil Engineers (ASCE) Student Chapter at MIT and strives to uphold the values of excellence in academic and professional environments. Through service projects, educational programs, and social functions, CEESA aims to foster a vibrant and supportive community that enables every student to reach their highest potential.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52677",
    "name": "Climate and Energy Prize",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2507697_CEP_Logo_updates_101611499.png",
    "website_url": "http://cep.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Climate & Energy Prize connects student climate entrepreneurs, MITstudents, and a network of interested community members who arepassionate about energy, climate change, and entrepreneurship. Since 2007, the Climate & Energy Prize has been MIT’s flagship climate entrepreneurship platform for student entrepreneurs to gain experience,visibility, and funding for their ventures.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53287",
    "name": "Climbing Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://climbing-club.scripts.mit.edu/climb-on/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of our group is to increase the accessibility of indoor rock climbing within the MIT community and form an indoor rock climbing community. We want to provide transportation to and from climbing gyms, be able to subsidize day passes/ memberships for students who would otherwise not be able to afford them and form a community.  We will focus on several types of climbing including lead, bouldering, and top rope. We want to appeal to a variety of community members- from people who have never rock climbed before to experienced climbers. We hope to provide a warm and welcoming environment for students at MIT to join and take a break from their PSETS.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53051",
    "name": "Clubchem",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/clubchem/www/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Club is to encourage interaction between faculty and students, to provide a social environment for members, and to represent a population of MIT whose interests involve chemistry.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53176",
    "name": "Code for Good",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://codeforgood.mit.edu/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Code for Good is to bring students together with local nonprofit organizations to make a direct, positive impact on our community using computer science skills",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53363",
    "name": "College Republicans",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/gop/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT College Republicans is a group of students united by shared conservative values which it wishes to promote within MIT and the surrounding community. The group shall seek to inform its members about the philosophy of the Republican Party; provide logistical support and assistance to local, state, and national campaigns; raise awareness about issues pertinent to the Republican Party; and develop the civic engagement, political skills, and leadership abilities of its members to prepare them for future service their community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53086",
    "name": "Colombian Association of MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2485189_Logo_Colombian_Associationjpg_518215523.jpeg",
    "website_url": "http://colombianos.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Colombian Student Association of MIT is a student-led organization recognized by MIT's Association of Student Activities (ASA). Our purpose is to share the Colombian culture at MIT and the Greater Boston Area, to bring together the Colombian MIT community, to organize academic and non-academic events with other student associations, to strengthen relationships between academia and policymakers in Colombia interested in the fields of study promoted by MIT, and to foster the connection between MIT and Colombia.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52969",
    "name": "Concert Band",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2599436_MITCB_logo_83K_914171938.png",
    "website_url": "http://band.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Concert Band is a group of amateur musicians.Participation in the group should provide a sense of enjoyment and enthusiasm in thecreation of music. The group should be open to persons of all musical backgrounds andskills, and it should provide a vehicle for developing musical talents in a large ensemblesetting. Student members should feel a sense of ownership in the group.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53120",
    "name": "Concert Choir Students",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/21m401/www/index.shtml",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of this organization shall be to externally support, rep- resent, and serve the students of the MIT Concert Choir (21M.401); to promote the Choir’s concerts, auditions, and activities; and to serve as a general advocate for choral music at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53067",
    "name": "Consulting Club at MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2491803_CCM_logo_914171626.jpeg",
    "website_url": "http://web.mit.edu/mitconsulting/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The Consulting Club at MIT (CCM) aims to facilitate a seamless transition from graduate school to a successful career in management consulting through awareness, skill building, and networking.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52946",
    "name": "Consulting Group",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://consulting.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Consulting Group is to educate and develop members professionally through industry and recruiting events, mentorship, community bonding events, and case studies with companies.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53230",
    "name": "Council for Math Majors",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/CMM/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The Council for Math Majors (CoMM) is a student-run advocacy group in Course 18 committed to amplifying undergraduate voices and opinions within the math department. CoMM gathers input from students to understand what parts of the undergraduate experience could benefit from revision, from best advising practices to resources available on the math department website. Then, CoMM collaborates with faculty and staff to suggest improvements and work towards department-wide solutions.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": null,
    "name": "Cross Products",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://xprod.mit.edu",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Cross Products are a Christian a cappella group that communicates the good news of Jesus Christ through music, skits, and the spoken word. We exist to glorify God through music and our lives, and to tell others of the ways He has changed us.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53045",
    "name": "Cru",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2469179_MITCruLogojpg_107101316.jpeg",
    "website_url": "http://www.mitcru.com",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "To be a movement led and empowered by the Holy Spirit to help every student on campus hear and experience the Gospel of Jesus Christ, build students to be devoted followers of Jesus, and to send out equipped laborers to the campus and to the world to make an impact for Christ for a lifetime.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52971",
    "name": "DanceTroupe",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2490348_dtlogoblack_101312160.png",
    "website_url": "http://dancetroupe.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "Our student organization meets on an as-needed basis. Please email us at [include your group's officer mailing list here] for information about the date, time, and location of our next meeting.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53035",
    "name": "Debate Team",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://debate.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Debate Team is to compete on the American Parliamentary DebateAssociation collegiate debate circuit, educate members about the fundamentals ofparliamentary debate, and offer opportunities to practice and write cases with a group of otherdebaters.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52690",
    "name": "Design Build Fly",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2598581_biggersquarelogoforariel1_1_1011231030.png",
    "website_url": "http://mit.edu/dbf/www",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "To Design, Build, and Fly Airplanes",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52691",
    "name": "Design for America",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://designforamerica.mit.edu/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "At MIT's Design for America, we are committed to creating social impact through engineering and design. As a group, we build, develop, and create solutions to real world problems in the local community, working with community partners in the area. In addition, we run skill-building sessions to help students gain the skills they need to make a difference and support each other in the DFA community to make the world a better place.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52693",
    "name": "Digital Art and Animation at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://daamit.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "To provide an environment where MIT community members can express their creativity through an art form of their choice and collaborate with other artists who specialize in different art forms.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53373",
    "name": "Disability Justice Collective",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/djc/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Disability Justice Collective explores the topics and intersection of disability, justice and liberation at MIT. We advocate for the rights, interests, and dignity of disabled persons globally, from within MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53332",
    "name": "Disabled@MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/disabled/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Disabled@MIT is to build community among disabled students at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53360",
    "name": "Doctors Without Gravity",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/amsro/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Doctors Without Gravity is the Harvard/MIT student chapter of the the Aerospace Medical Association (AsMA) with the Aerospace Medical Student and Resident Organization (AMSRO). We are a joint chapter between Harvard and MIT, the first of its kind!Our goal: To foster educational awareness and create opportunities in aerospace medicine, spaceflight biology, and human space exploration broadly. We hope to create a diverse collaborative community inclusive of everybody--from undergraduate and graduate students, to medical students, to faculty, and to all levels of training in between.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53018",
    "name": "dynaMIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://dynamit.mit.edu/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of dynaMIT is to provide Boston/Cambridge area middle school students from underserved families an opportunity to learn and experience science and engineering through hands-on science experiments and challenges. This is accomplished through two free, week-long summer science programs: one week is for sixth and seventh graders, while the second week is for eighth and ninth graders. MIT undergraduates serve as mentors and role models who teach students about science and how it relates to their daily lives. The mentors give them a fun and safe environment to explore their interests, and encourage them to consider potential careers in science and technology.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52972",
    "name": "E33 Productions",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/E33/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "E33 does lights.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52697",
    "name": "EAPS Student Advisory Committee",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/ESAC/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "E-SAC is a student-run group that organizes social events and support programs aimed atbringing the EAPS graduate student community closer together. E-SAC also serves as a forumfor student concerns and represents those concerns to the administration and faculty.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52708",
    "name": "Educational Studies Program",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://esp.mit.edu/teach",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "Spreading the joy of teaching and learning.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53121",
    "name": "Educational Technologies Group",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://etg-acme.scripts.mit.edu/",
    "categories": ["Resources and Support"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of ACME is to establish a place where all minority graduate students are encouraged to share goals and expectations, express ideas, concepts, and frustrations without rebuke, while fostering an atmosphere of accountability.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53087",
    "name": "Egyptian Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/egypt/index.html",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Egyptian Association is a student body whose members are united by their common interest in Egyptian culture. The club aims to raise awareness of the multifaceted cultural identity by hosting events which feature prominent speakers, and through the lens of media and arts exposure. Events will also introduce Egyptian and middle eastern cuisine to the community while celebrating the diverse observances.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53338",
    "name": "Electrochemical Society",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/electrochem/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the ECS MIT Student Chapter is to create an institute-wide community of students interested in electrochemistry and to promote this area at MIT and beyond.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52712",
    "name": "Electronic Research Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2502676_miterslogo2_42520131.png",
    "website_url": "http://miters.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "To encourage and assist student projects for electronic and mechanical construction.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52713",
    "name": "EMS MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://ems.mit.edu/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "To support the health of the MIT campus and greater Cambridge and Boston communities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52716",
    "name": "Engineers Without Borders",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://ewb.mit.edu/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Engineers Without Borders is a chapter of EWB-USA, a non-profit organization that partners with communities in developing countries in order to implement community-driven projects that will be both beneficial and sustainable.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53291",
    "name": "Entrepong",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2515048_entrepong_26164947.png",
    "website_url": "https://engage.mit.edu/epg/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to connect undergraduate and graduate students interested in entrepreneurship with each other and with entrepreneurs who have experience in the field all over a game of ping pong.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52719",
    "name": "Eta Kappa Nu",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2506793_20EA381nIEEEHKNCrestVector_721134826.png",
    "website_url": "http://hkn.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Eta Kappa Nu (HKN) is a national honors society for electrical engineering and computer science. Our chapter of HKN — Beta Theta — is MIT’s distinguished community of exceptional computer scientists who leverage their intellect and expertise to solve the most pressing problems at MIT and beyond. At HKN, we offer exclusive career opportunities to members and connect them with HKN alumni in elite graduate programs, companies, non-profit organizations, and government agencies. We are the backbone of top-of-the-line student academic support in Course 6. We are also the foundation of many digital services used widely by the community, including the Underground Guide.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52720",
    "name": "Ethiopian Eritrean Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://eesa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of MIT EESA is to bring about awareness and understanding of Ethiopian/Eritrean culture to the MIT community, as well as to residents of the Cambridge and Boston area. In addition, the group will strive to create a venue where Ethiopian/Eritrean students and those interested in Ethiopian/Eritrean culture can interact and learn from one another's experiences.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53088",
    "name": "European Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2502434_white_background_logo_1016151610.png",
    "website_url": "http://euroclub.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT European Club organizes social and cultural events that promote the interaction between MIT students and affiliates with other greater‐Boston‐area students and scholars, whether they are from Europe, or just have an interest in Europe. The MIT European Club organizes an annual career fair to allow the hiring of interested candidates by companies or institutions that are European or that have European subsidiaries.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53004",
    "name": "Filipino Students Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2616925_MIT_Filipino_Students_Association_1_51022525.png",
    "website_url": "http://mitfsa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Filipino Students Association (FSA) is a community of people who appreciate Filipino culture. The group seeks to:• provide a community for Filipino or Filipino-identifying students;• strengthen members’ connections with their culture and heritage; and• promote awareness of Filipino culture within the greater MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52973",
    "name": "Fixation",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2473306_Fixation_X_logo_52223358.png",
    "website_url": "http://www.facebook.com/mitfixation?ref=ts",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Fixation was originally founded in Spring of 2010 by a group of dedicated dancers who are committed to improving on the contemporary dance styles, including lyrical, contemp, jazz, etc. MIT Fixation wants to showcase these styles at MIT and at other schools in the Greater Boston area. Past performances have included guest performances at World of Dance, Ring the Alarm, Footwork, Breaking Bounds, and guest performances for various MIT clubs and dance groups. In 2022, we started the tradition of choreographing and hosting our very own annual team showcase in the spring as a way to share the diverse forms of dance that our team is capable of with MIT and beyond. Most importantly, we want to have fun dancing!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53037",
    "name": "Flying Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2620193_Screenshot_20250310_160630_3101675.png",
    "website_url": "https://mit-flying-club.webflow.io/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "To enhance access to aviation for students and members in the greater Boston area.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53356",
    "name": "French Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2497263_10_82419531.png",
    "website_url": "https://engage.mit.edu/france/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "This organization aims at bringing together French community at MIT including:French students and staff and their spouses and partners.Québec (Canada) students and staff and their partners.French speaking community at MIT.French culture enthusiasts.The organization’s actions include:Organize events that foster and share French culture in MIT campus.Gather French speaking community in MIT campus.Enabling connections between MIT and other French associations in Boston area, in the United States and/or France.The organization aims to be welcoming, inclusive and open to anyone who wants to belong to this community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52722",
    "name": "Fuyun Chinese Comedy Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2479689_logo_12121781.jpeg",
    "website_url": "http://web.mit.edu/~fuyun",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of our group is to create a community for the Chinese Traditional Crosstalk (Xiangsheng) comedians to improve their performing skills by sharing learning experiences among ourselves and to organize regular comedy show events to serve the public, who are interested in this unique Chinese culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53394",
    "name": "G@MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/LGBTQ/",
    "categories": ["Gender and Sexuality"],
    "organization_type": "ASA Student Organization",
    "mission": "G@MIT is a student organization with a mission to provide community, support, and advocacy for undergraduate LBGTQ+ students.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53376",
    "name": "Game Developers Guild",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2620179_gim_212171955.png",
    "website_url": "https://gdg.mit.edu",
    "categories": [
      "Arts",
      "Games and Puzzles",
      "Hobbies and Special Interests",
      "Technology"
    ],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Game Developers Guild is to foster community among students interested in game design and development, including but not limited to game designers and developers, artists, music composers, and animators.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53395",
    "name": "Generational African American Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/GAASA/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Generational African American Student Association  is to support the welfare of Generational African American students on campus, to increase understanding and awareness of the specific struggles of those descending from the system of slavery in the United States, and to combat those struggles inside of and outside of the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53301",
    "name": "GFLI@MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2506080_GFLI_321154642.png",
    "website_url": "https://engage.mit.edu/GFLI/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT's community of First Generation/Low Income students across all Graduate Programs. This group aims to provide a sense of community for graduate students from first generation/low income (GFLI) backgrounds, as well as providing them with the skills and connections to help them thrive at MIT graduate programs and beyond.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53371",
    "name": "Global Startup Workshop",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MITGSW/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Global Startup Workshop Group, or GSW, aims to support the development of healthy entrepreneurial ecosystems globally.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53025",
    "name": "Go Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/go/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of The MIT Go Club, hereafter referred to as the Club, is to promote the game ofGo within MIT. To accomplish this goal, the Club strives to provide facilities where all membersof the community can meet to enjoy the game of Go. It may also sponsor events that promoteawareness and enjoyment of the game",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52729",
    "name": "Graduate Association of Aeronautics and Astronautics",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://ga3.mit.edu/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "For AeroAstro Graduate Students, promote student well-being, establish a formal student-department relationship, foster a sense of professional and personal community within the department, increase department presence and student involvement throughout MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52730",
    "name": "Graduate Association of Mechanical Engineers",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://game.mit.edu/",
    "categories": ["Resources and Support"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Graduate Association of Mechanical Engineers (GAME) is to represent current graduate students within the Mechanical Engineering department at MIT. Our goal is to organize social and professional activities which strengthen and enrich the community within the department, and to help publicize various research activities within the department. We organize social hours, host talks by guest speakers and students, and help communicate with the department and the Graduate Student Council We encourage all current Mechanical Engineering graduate students to come forward and participate in the group. Members along with the GAME officers play important roles in spearheading many of GAME's initiatives, activities, and student advocacy issues.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53106",
    "name": "Graduate Christian Fellowship",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://gcf.mit.edu/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Graduate Christian Fellowship is a faith community of Christians in the MIT community, primarily graduate students, who desire to know, love and obey God better and to reflect the love and presence of Jesus Christ. We strive to accomplish this in the following ways:1) Encourage one another to deepen our individual relationships with Jesus Christ by emphasizing a foundation of prayer, study of the Bible, worship, obedience to God and involvement with local churches.2) Be a community that addresses the unique needs of Christian graduate students and that cares for one another as part of God’s larger family.3) Think critically about the implications of the Christian faith on our academic disciplines. Bring our pursuits, careers, and all our work under the lordship of Christ.4) Corporately and individually proclaim Jesus Christ as Lord and Savior to the MIT community.5) Help meet the physical and personal needs of our neighbors at MIT and in the Boston area.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52731",
    "name": "Graduate Economics Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://econ-www.mit.edu/graduate/gea",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The GEA organizes social events and acts as a liaison between students and faculty.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53107",
    "name": "Graduate Hillel",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://hillel.mit.edu/content/gradhillel",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "As the center for Jewish life at MIT, MIT Hillel is a welcoming, pluralistic environment for all Jewish students, as well as for Jewish MIT alumni, faculty, and staff. Hillel celebrates and supports the development of individual Jewish identities on the MIT campus and within the greater Jewish community.https://hillel.mit.edu/content/our-mission",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52732",
    "name": "Graduate Materials Council",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://gmc.scripts.mit.edu/home/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The Graduate Materials Council acts as advocates for DMSE graduate students. Members of the GMC serve on the Graduate Student Council, the institute-wide graduate committee and three student representatives serve on the Departmental Committee on Graduate Studies, the group responsible for decisions regarding the curriculum and qualifying procedures. The group also plans many social activities for the students in the department, as well as field teams for intramural sports.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53405",
    "name": "Graduate Muslim Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/GradMSA/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the Graduate Muslim Student Association (GMSA) is to provide a dedicated community space that specifically addresses the spiritual, social, and professional needs of Muslim graduate students. Unlike the already existing Muslim Student Association (MSA), the GMSA uniquely focuses on graduate students’ experiences and responsibilities, which differ significantly from those of undergraduates—the primary target audience of the MSA. The community space aims to facilitate deeper connections among graduate peers, provide tailored spiritual guidance, offer networking and professional development opportunities specifically relevant to graduate students, and support members navigating challenges unique to graduate life, including balancing intensive academic research, career preparation, and family responsibilities.The raison d’être of the GMSA arose naturally from the consistently low turnout of graduate students at MSA events and from the expressed enthusiasm within the graduate community for establishing a dedicated association that actively responds to their specific circumstances and needs. Through this distinct focus, the GMSA seeks not only to strengthen the engagement of Muslim graduate students within the MIT community but also to enhance collaboration with other graduate-focused organizations, enriching the broader campus experience.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52737",
    "name": "Graduate Women in Aerospace Engineering",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/wga3/www/index.shtml",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Graduate Women in Aerospace Engineering (GWAE), is to representand support the women and gender minorities in the MIT Department of Aeronauticsand Astronautics. The organization will:1. Foster a strong community among AeroAstro graduate women and genderminorities2. Recruit women and underrepresented minorities and advocate for diversity incollaboration with the MIT AeroAstro Diversity, Inclusion, and Innovation.Committee3. Support the personal, academic, and professional development of AeroAstrograduate women and gender minority students4. Enhance ties with AeroAstro undergraduate women and gender minoritiesthrough sponsorship of a graduate-undergraduate mentor program5. Participate in STEM outreach events6. Maintain a relationship between AeroAstro women faculty and graduate women7. Serve as a liaison for communication between the AeroAstro department and thegraduate women body",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52738",
    "name": "Graduate Women of Course 6",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://gw6.scripts.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Graduate Women’s Group of Course 6 is to enhance the experience of women in EECS.  The group will provide graduate women in EECS an opportunity to network with other women in the department, develop mentorships and friendships, and gain support in completing their degree.  We are also interested in providing mentorship to undergraduate women in EECS.A further goal of the Graduate Women's Group of Course 6 is to support and initiate outreach programs in order to encourage younger women to explore engineering. In addition, we aim to enrich the professional development of graduate women in EECS and broaden their perspective of future career paths.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52739",
    "name": "Greater China Student Network",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://cusa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Greater China Student Network (GCSN) is to provide a comfortable space for Chinese students and the Mandarin-speaking community. We provide support to each other, celebrate holidays, and promote Chinese culture together.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53126",
    "name": "Hacking Medicine",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://hackingmedicine.mit.edu/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Hacking Medicine is to infect, energize, and empower a diverse, global community in healthcare entrepreneurship and innovation to scale medicine to attack and solve healthcare problems.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52741",
    "name": "Harvard MIT Mathematics Tournament",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://www.hmmt.org/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to encourage interest in math, to engage a diverse community of students and support them in reaching beyond traditional math curriculums, and to provide insight into what a future in math may look like.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53006",
    "name": "Hawaii Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Hawaii/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Hawaiʻi Club seeks to provide support for MIT students from Hawaiʻi and connect them with each other. Hawaiʻi Club also seeks to share Hawaiian culture and modern Hawaiʻi culture to the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52742",
    "name": "Hellenic Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://hsa.mit.edu",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the Hellenic Students' Association (HSA) at MIT is to build a cohesive and supportive community for MIT students of Greek and Cypriot origin. The association aims to achieve this by organizing a wide array of activities encompassing cultural, social, athletic, artistic, and educational domains. In addition, the HSA serves to welcome and guide newly admitted Hellenic students and acts as a liaison between the Hellenic student body, MIT officials, other student organizations, and Hellenic communities globally. The association operates in adherence with MIT's regulations, notably refraining from engaging in political activities as defined by the Institute.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53047",
    "name": "Hillel MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://hillel.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "As the center for Jewish life at MIT, MIT Hillel is a welcoming, pluralistic environment for all Jewish students, as well as for Jewish MIT alumni, faculty, and staff. Hillel celebrates and supports the development of individual Jewish identities on the MIT campus and within the greater Jewish community.MIT Hillel offers a vibrant program of religious, educational, social, and Israel activities that enable the exploration of Jewish culture, tradition, and scholarship. Hillel strives to satisfy the spiritual, intellectual, and personal needs of all Jewish students.Hillel enriches the lives of Jewish students so that they may enrich the Jewish people and the world.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52743",
    "name": "Hindu Students Council",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2489127_hsclogo_29165811.png",
    "website_url": "http://web.mit.edu/hsc/www/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Hindu Student Council brings together all those who are inspired by the unbroken lineage of spiritual and philosophical thinkers, Rishis and Rishikas, who have sought answers for eternal truths.We are the followers of Sanatan Dharma, practitioners of 5000 years of unbroken principle that tells us that “ekam sat vipra bahudha vadanti: That which exists is One; the sages call it by various names. We are a community that fosters the Sanatan Hindu philosophy, culture and religion within the MIT and adjoining community.We celebrate Pujas and Festivals and seek to spread the joy of knowledge. We are here for each other, our goal is to help each of us discover the divine within and realize “thou art that” tat tvam asi.The mission of MIT HSC is to promote understanding of Hindu culture and heritage, foster awareness of issues affecting Hinduism, and provide service to the community. We do this by helping students experience Hinduism through celebrations of Hindu festivals, regular discussions, satsanga sessions, classes and symposia and guest lectures. We are open to people and ideas of all faiths and backgrounds.Whether you identify as a Hindu or are curious about the religion, we welcome you to join us!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53380",
    "name": "HongKong@MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/hongkong/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The organization undertakes to provide guidance and support to newly matriculated students, to promote the exchange of cultural values between members of the MIT community and those of Hong Kong, and to orchestrate and administer events of a social, academic, and professional nature that concern Hong Kong, its culture, and its peoples.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53392",
    "name": "Horology Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Horology/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Horology Club is to introduce MIT students to the basic principles of mechanical watch making and repair.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53110",
    "name": "HST Student Community",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://hst.mit.edu/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The graduate students and medical students in HST shall be known collectively as the HST student community. Their official representative body shall be known as the HST Joint Council.The purposes of the HST Joint Council are:1. To encourage a sense of community within HST2. To provide a formal means of communication among graduate students, medical students and the HST Administration3. To ensure student representation within the HST, Harvard, and MIT communities4. Advocate for HST students as necessary with HST, MIT, and Harvard administration5. To manage funds allocated by the HST administration for student use6. To build a social community of medical engineers and medical scientists within MIT and Harvard",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53177",
    "name": "IAP Web Programming Competition",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://weblab.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Students form teams of 1-3 people and learn how to build a functional and user-friendly website. Lectures and workshops teach everything you need to make a complete web application. Topics include version control, HTML, CSS, JavaScript, ReactJS, and nodejs. All teams are eligible to enter a competition where sites will be judged by industry experts. Beginners and experienced web programmers welcome, but some previous programming experience is recommended.  Students must register at https://portal.weblab.is. Registering via WebSIS does NOT automatically put you on the official class mailing list.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52746",
    "name": "IDSS Student Council",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2477701_IDSS_Horizontal_FullColorjpg_97172151.jpeg",
    "website_url": "https://engage.mit.edu/IDSS/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the IDSS Student Council is to promote community within the diverse programs, labs, and student groups associated with our academic unit, IDSS. We also provide a channel to connect IDSS students with IDSS leadership.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52974",
    "name": "Imobilare",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://www.instagram.com/imobilaremit/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "We are MIT’s premiere breakdancing/freestyling crew, founded in 1991. We help to keep breakdancing culture alive on campus and in Cambridge/Boston communities. We actively participate in Boston’s hip-hop scene and work with breakdancing crews and non-profits alike to bring freestyling to as many people as possible. We offer classes on campus, participate in events, and hold public practice sessions and small cyphers for all MIT students and the general public to join.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52961",
    "name": "Impact@MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://impactclub.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Impact@MIT is to support the efforts of members of the MIT community interested in having a positive impact in the world.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53359",
    "name": "Individualized Tutoring for English and Citizenship",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/itec/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "ITEC (Individualized Tutoring for English and Citizenship) empowers immigrants in Massachusetts by providing free, one-on-one virtual tutoring in conversational English and citizenship exam preparation. By pairing them with MIT students who have a passion for service, ITEC fosters cross-cultural exchange, promotes community service, and equips students with a deeper understanding of the immigration and naturalization process.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52747",
    "name": "Infinite Magazine",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://infinitemagazine.mit.edu",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "Infinite Magazine's purpose is to foster a collaborative creative community and enable members to be able to learn and exercise skills pertaining to fashion design, fabrication, photography, visual and graphic design, writing, etc. To showcase each year's worth of effort, the club produces a tangible culmination of member work in the form of a magazine.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53068",
    "name": "Informs MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.informs.org/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "We are the student chapter of the Institute for Operations Research and the Management Sciences (INFORMS) professional organization. We organize department events for students (and occasionally faculty and alumni) of MIT's Operations Research Center.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52748",
    "name": "Institute of Electrical & Electronics Engineers",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://ieeeacm.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT IEEE/ACM Club represents the student branch for two professional international organizations, the Institute of Electrical and Electronics Engineers (IEEE) and the Association for Computing Machinery (ACM).Our mission is to create and support a tight-knit community among the students and faculty in the Department of Electrical Engineering and Computer Science (EECS) at MIT.Get involved with all things course 6 and beyond by coming to our events! You'll meet students who are just as passionate as you are in the diverse color spectrum that is course 6 as well as professors and leaders in the field.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52750",
    "name": "International Students Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2612441_462539983_888195620079224_7481301200233179609_n_2jpg_2121134.jpeg",
    "website_url": "http://isa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of this organization is to further the following objectives:(a) To bring together the diverse community of undergraduate and graduate internationalstudents at MIT(b) To improve the well-being and MIT experience of international students, supporting themthroughout their education at MIT as well as in their future endeavors.(c) To create a network of current, admitted, and former international students to provideguidance, facilitate transition, and increase enrollment.(d) To facilitate the sharing of cultural, academic, and social elements from the diverse backgroundsof international students with each other and the broader MIT community.(e) To serve as a vessel for international students to access resources and opportunities at MITand the broader MIT community.(f ) To foster unique collaborative events between international and cultural clubs at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52751",
    "name": "Intervarsity",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://mit-iv.scripts.mit.edu/web/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of MIT InterVarsity (MIT-IV) is to be a diverse witnessing community seeking to see lives transformed through engaging with the Person of Jesus by growing in love for God, God’s Word, people of every ethnicity & culture, and God’s purposes in the world. We seek to develop as followers of Jesus Christ as Lord and Savior in response to God’s love, grace and truth. We aim to actively engage with campus as participants of the larger MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53313",
    "name": "iQuHACK",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2468077_AB121767EC0745E39F9788817B509570_4_5005_c_6211485.jpeg",
    "website_url": "https://engage.mit.edu/iQuHACK/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "Our purpose is to provide educational experiences for students and enthusiasts interested in quantum information science and quantum technology, and seek to connect students with leading quantum technology experts in academia and in industry.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53308",
    "name": "Irish Dance Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/IDC/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the MIT Irish Dance Club is to foster a vibrant community where students can actively participate in the art of Irish Step Dancing. Our purpose is to cultivate opportunities for learning, choreography, and performance, ensuring that individuals of all experience levels are welcomed and encouraged. Through regular classes and workshops open to both members and the broader MIT community, we aim to create an inclusive space for the exploration and practice of Irish dance. Committed to promoting teamwork, respect, and inclusivity, our club seeks to organize captivating performances both on campus and in the greater Boston-Cambridge area, providing a secure and supportive environment for all members to thrive.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52752",
    "name": "Japanese Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/jam/www/index.html",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Japanese Association aim to bring cultural experiences to the MIT community by organizing events that introduces the essence of Japanese culture to students, faculty, and families. By providing a vibrant and immersive cultural experience for people of all ages and backgrounds, we hope to foster cultural exchange, build community connections, and showcase the unique Japanese traditions in a meaningful and engaging way.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53007",
    "name": "Japanese Society of Undergraduates",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2504667_icon_1016115332.png",
    "website_url": "http://japan.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "To promote Japanese culture within MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53347",
    "name": "Jews for Collective Liberation",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/j4cl/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Jews for Collective Liberation is a student group focused on providing a progressive space for Jewish students in the MIT community. We aim to create a network of Jewish students for the purpose of hosting cultural, religious, and political events aligned with the principles we work by: love, equity, and justice.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53386",
    "name": "Kehillah",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Kehillah/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Kehillah is a student group focused on creating a religious space for progressive Jewish students in the MIT community. We aim to build out space for Jewish students, who currently do not feel comfortable or welcome in the MIT Jewish community, to participate in their religious and cultural practices.MIT Kehillah seeks to create Jewish space on campus that uniquely grounds spiritual and religious practices in inclusivity and progressive ideals. Our focus allows students to explore the intersectionality of their identities, demonstrating that Judaism is not monolithic but can be dynamically woven into the fabric of broader social and political conversations.Kehillah is independently run by MIT students, staff, and faculty, without influence or oversight from outside organizations. We provide a home for Jewish students who wish to engage with Jewish culture, religion, and identity in a way that is empowering, emphasizes intersectionality and diversity, and is Diaspora-centric.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53383",
    "name": "Kenyan Students’ Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2501452_Kenyan_Club_Logo_423192638.png",
    "website_url": "https://engage.mit.edu/kenya/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to celebrate and promote Kenyan culture, heritage, and values while providing support for academic, professional, and personal development for our members. We strive to build meaningful connections and enhance the broader MIT community through our shared experiences and initiatives.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53388",
    "name": "Kidney Disease Screening and Awareness Program at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/KDSAPMIT/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The Kidney Disease Screening and Awareness Program raises chronic kidney disease (CKD) awareness and prevention by providing free health screenings and education for early detection of risk factors of CKD to underserved populations.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53331",
    "name": "Knitting and Crochet Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/knitt/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the Knitting and Crochet Club is to provide a space for artists who like to knit, crochet, embroider, needle felt, etc., to get together for socials to 1) work on their individual projects and 2) learn new crafts as beginners.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52756",
    "name": "Korean Cultural Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2478102_KCAlogo_black_fall2020_10210380.png",
    "website_url": "http://kca.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Korean Cultural Association is a cultural club dedicated to creating a community of people who are interested in Korean culture and the Korean language. We mainly organize community events that are intended to bring together these people with mutual interest or curiosity in Korean culture. Some examples of previous events with very large turnout are our Chuseok holiday celebration and Korean Street Food Festival. Both events attracted over 100 people, and our club was able to organize an event where people could come, meet people, and bond over the entertainment and food that was offered at these events. This group is an important part of campus for Korean-American students who want to connect more with their Korean background. This does NOT mean that we are just for Korean people. Anyone is welcome at any of our events, and we welcome anyone who is respectful of Korean culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52754",
    "name": "Korean Graduate Students Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2478194_KGSA_Logojpg_5101056.jpeg",
    "website_url": "http://mitkgsa.com",
    "categories": ["Resources and Support"],
    "organization_type": "ASA Student Organization",
    "mission": "Contribute to MIT community and broader society from Korea-based knowledge and culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53039",
    "name": "Laboratory for Chocolate Science",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2489910_logo_35123622.png",
    "website_url": "http://chocolate.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "Founded in 2003, the Laboratory for Chocolate Science (LCS) is dedicated to spreading the appreciation of chocolate on campus, and to bringing opportunities for learning about, appreciation of, and indulgence in our favorite substance to the community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53406",
    "name": "Latin Music Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2627942_Copy_of_SML_82013614.png",
    "website_url": "https://engage.mit.edu/LatMusicSociety/",
    "categories": ["Arts", "Cultural", "Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The Latin Music Society (LMS) strives to create a space for MIT affiliates from all walks of life to rehearse, perform, and learn the cultural significance of Latin music through collaboration with their peers and professional musicians. LMS will have subgroups consisting of various genres such as mariachi, salsa/son, latin jazz, etc. and members may start groups to make music within a Latin genre of their choice.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53008",
    "name": "Latino Cultural Center",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2502456_LCC_black_1030171636.png",
    "website_url": "http://latino.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Latino Cultural Center (LCC) functions as the hub for Latino students and student organizations, as well as individual community members interested in learning more about Latino culture. The LCC is composed of two main parts, the business offices of the student organizations, and the lounge for academic and social activities. The purpose of the LCC is to provide a space for students to meet with study groups or to study individually, to socialize, and to hold cultural and social events hosted by the six member organizations and the LCC exec team.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52760",
    "name": "LatinX Graduate Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://lgsa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the LGSA is to organize and maintain a thriving community that will support MIT Latinx graduate students in their personal, academic, and professional endeavors and well-being.The LGSA seeks to empower its members through the creation of a strong network within the MIT community, structured primarily through ongoing cultural and social events.Where appropriate, the LGSA will serve as a channel to represent and communicate the needs of its members to other stakeholders, including MIT’s institutional leadership.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53372",
    "name": "Latte Lab",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/latte/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Latte Lab is to foster a vibrant community at MIT centered around the science, craft, and culture of coffee.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52761",
    "name": "Latter day Saint Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/LDSSA/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT LDSSA serves as a community to help people connect through faith in Jesus Christ.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52763",
    "name": "Leadership Training Institute",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://lti.mit.edu",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The Leadership Training Institute (LTI) is a 10-week program in which MIT undergraduates mentor Boston-area high school students, helping them gain leadership skills while implementing original community service projects. Many high school students are passionate about solving community problems; however, they often lack the experience and mentorship to effectively pursue their ideas. At LTI, we offer such motivated students the skills, guidance, and individualized support to translate their ideas into real impact. By pairing local high school students from underprivileged backgrounds with MIT undergraduates who have previously implemented successful community service projects, LTI helps high school students and MIT undergraduates alike develop their untapped leadership and service potential. In this way, LTI catalyzes branching social change by cultivating innovative ideas. As a student-run organization that hosts ~60 high school students yearly at no cost to them, we depend on grants to carry out our mission.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53089",
    "name": "Lebanese Club at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://lebaneseclubmit.wordpress.com/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The LCM shall be a nonprofit, nonpartisan MIT-based organization established in 1970 to foster a sense of community among the Lebanese students at MIT and to promote Lebanese culture and concerns in the Institute and the Boston area at large.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52765",
    "name": "Lecture Series Committee",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2600612_LSC_Logo_Borderless_415114157.png",
    "website_url": "https://engage.mit.edu/LSC/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Lecture Series Committee has been bringing quality entertainment to the MIT campus since 1944. In 1950 our popular film program began. Over the years, we have kept at the forefront of cinema technology, featuring four-track magnetic surround sound when monaural sound was the norm. Thus was born the phrase \"IN STEREO!\" -- an in-joke in the MIT community (come to an LSC movie and find out why).Today, LSC features state-of-the-art digital motion picture projection on a 26'x13' screen and 5.1 Dolby Digital surround sound, with over 9000 watts of amplification in addition to a newly revived 35 mm projection series with a two-projector changeover system. Our weekly films showcase a diverse selection of Hollywood blockbusters, foreign and independent film, and the best of classic cinema.From time to time, LSC also features special events such as the Science Fiction Marathon, advance screenings of films not yet released to theaters, lectures by famous personalities, concerts, and more.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53100",
    "name": "LGBT Grad",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.mit.edu/~lgbtgrad/",
    "categories": ["Gender and Sexuality"],
    "organization_type": "ASA Student Organization",
    "mission": "We serve to support LGBTQ+ graduate students and allies at MIT. While our main focus is on the graduate community at MIT, our events and opportunities are often open to the broader queer community at MIT and beyond.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52903",
    "name": "Life on Stage Theatre",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://lost.mit.edu",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "Life on Stage Theatre (LOST) is a performance group that produces plays each semester that investigate the human condition.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53076",
    "name": "Lindy Hop Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2480873_lhsLogo_0_914171820.png",
    "website_url": "http://swing.mit.edu",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Lindy Hop Society is a student group at MIT where folks that love to swing (dance) come together! You’ll find Lindy, Charleston, and East Coast styles on our dance floor, along with the occasional dabble in West Coast and others.We have a thriving community of student dancers, and we place strong emphasis on having a safe atmosphere where everyone can have fun and learn to dance together.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52975",
    "name": "Lion Dance Group",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://scripts.mit.edu/~lion-dance/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of this organization shall be to promote the art of Chinese liondancing on the Massachusetts Institute of Technology (MIT) campus and othercollege campuses across the East coast.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52767",
    "name": "Live Action Mafia",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://mafia.csail.mit.edu/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "We play Live-Action Mafia, the real-time, real-life version of the party game Mafia.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52768",
    "name": "Live Music Connection",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://lmc.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "We strive to promote musicianship on campus and to provide an opportunity for student musicians to develop their performance skills.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53222",
    "name": "Locksport",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/LKS/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "To teach and practice responsible locksport",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52770",
    "name": "Logarhythms",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2501404_bam_1030172056.png",
    "website_url": "http://logarhythms.squarespace.com/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the MIT Logarhythms is to bring together members of the MIT community who are passionate about a cappella through rehearsal and performance and to spread music in our community and beyond.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52772",
    "name": "LUCHA",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://lucha.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "LUCHA, formerly La Union Chicana por Aztlán, is dedicated to providingboth cultural and academic support to students who identify in any way withthe Latino culture. We are a familia dedicated to supporting each otherand creating bonds that last throughout student's 4 years here at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52773",
    "name": "Lutheran Episcopal Ministry",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://le-ministry.mit.edu/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The Lutheran Episcopal Ministry (LEM) is a Christian fellowship that welcomes all folks: undergrad, grad, or post-doc; sure of your faith or wondering what it is all about; gay, straight, bi, trans*, questioning. This is a space in which hard questions are welcome, and burdens may be shared or left at the door.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52759",
    "name": "MAES Latinos in Science & Engineering",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://maes.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "MAES Latinos in Science and Engineering is a social and professional development club for all Latino/a/x identifying students at MIT. We strive to encourage community-building through social and cultural events, as well as professional development through events with industry partners.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53355",
    "name": "Maghreb Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/maghreb/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Maghreb Students Association (MagMIT) is a student group focused on promoting Maghrebein culture and supporting Maghrebein students at MIT. We organize social and cultural events throughout the year, both individually and in collaboration with other clubs. MagMIT aims to create an atmosphere that allows people to enjoy and explore the beautiful culture of the Maghreb region in North Africa.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52775",
    "name": "Mahjong Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/mitmahjong/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Mahjong club is to provide an environment that fosters a community of students who enjoy playing mahjong",
    "membership_info": "$0 (Club member)Membership will end on 31 May 2026"
  },
  {
    "id": "52976",
    "name": "Marching Band",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2610453_MIT_MB_logo_v20_SMALL_59204613.png",
    "website_url": "http://web.mit.edu/marching-band/www/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The One and Only MIT Marching Band",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53122",
    "name": "Medlinks",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2508671_medlinks_logo2015011_921172736.png",
    "website_url": "https://medlinks.mit.edu",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The MedLinks program works to support MIT students in connecting to campus support resources, the policies and services of MIT Medical, and determining when and how to seek medical attention. MedLinks is a residentially-based peer health advocacy program that supports the health of students in their residences along with the wider MIT community through one-on-one interactions and via health promotion events. In addition, MedLinks can make available single doses of common over-the-counter medications, first aid supplies, and safer sex supplies.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52778",
    "name": "MentorConnection",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.mit.edu/~mconnection/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of MentorConnection is to facilitate conversations across all corners of the MIT campus, and between members of campus and MIT alumni.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53069",
    "name": "Microbiome Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://microbiome.mit.edu/get-involved/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Microbiome Club is to bring together inquisitive members of the Boston community, with a focus on undergraduates, graduate students, postdocs, research staff, faculty, and clinicians, in the emerging field of microbiome studies and microbiome-based medicine.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52779",
    "name": "Middle East Entrepreneurs of Tomorrow",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://meet.mit.edu/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "MEET's mission is to provide young promising leaders in the Middle East with tools to challenge the status quo through innovation. Our mission as a group is to oversee MEET's operation on campus and on the MISTI side of the program.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53378",
    "name": "MINCE",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MINCE/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "We believe that food is a form of connection, significant to preserving culture, an incredibly educational journey, and also one of the most important ways to maintain your health in the firehose that is MIT. Having listened to far too many of our peers complain about the poor quality of the dining halls, the lack of variety of food choices in our area, or simply being too busy to enjoy a proper meal, we realized that culturally diverse, nourishing, and delicious meals are always in high demand. There are many of us who crave the warm comfort and nourishment of a meal, and MINCE hopes to unify students by indulging this shared desire.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52977",
    "name": "Mirchi",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2599655_mirchi_logo_92117324.png",
    "website_url": "http://mirchi.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Mirchi is MIT’s premier, competitive Bollywood-fusion dance team! Our performances incorporate both South Asian and Western styles, including Bollywood, Hip-hop, Kuthu, Contemporary, Bhangra, and Indian classical. Over the past 12 years, we’ve had the honor of representing MIT and greater Boston at competitions and showcases across the country, sharing our passion for dance and our love for our culture.Every year, we put together an 10 minute set, including backdrops, costumes, and other props. Our themes over the past couple years include: IT, The Wizard of Oz, Phineas and Ferb, The Parent Trap, etc. Stay tuned for our upcoming performances!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52978",
    "name": "MissBehavior",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MissB/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "MissBehavior is MIT's first dance team representing marginalized genders, established in Spring 2019. Our team creates a safe and enjoyable space for empowerment through dance. We celebrate commercial styles and encourage exploration beyond our comfort zones. MissBehavior is a unique community for both intermediate and advanced dancers to be challenged and supported, all while having a good time.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53397",
    "name": "MIT African Graduate Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/AGA/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT African Graduate Association (AGA) exists to foster a strong,supportive community for MIT African graduate students, scholars, andpostdocs by catering to their unique needs and enhancing their overallwelfare. We aim to provide academic, professional, and cultural enrichmentwhile amplifying the voices and contributions of African researchers oncampus and beyond. In addition, we strive to leverage the research expertiseof MIT African graduate and post-graduate researchers while connectingthem with innovative initiatives in order to be at the forefront of African development.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53336",
    "name": "MIT AI Alignment",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MAIA/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of MIT AI Alignment (MAIA) is to raise awareness of the potentially-existential risks posed by advanced AI systems and to assist members of the MIT community in addressing these risks by means including, but not limited to, (i) providing opportunities for members of the MIT community to learn more about these issues, both from a technical and from a governance perspective, (ii) creating an environment for research and debate among members of the MIT community; and (iii) fostering a community of people who share the same concerns about the aforementioned risks.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53234",
    "name": "MIT Albanian Students Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2478460_Updated_MITASA_Logojpg_923144329.jpeg",
    "website_url": "https://engage.mit.edu/Albanian/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Albanian Students Association is to further the following objectives:1.\tTo bring together the considerable community of undergraduate and graduate Albanian students and American students of Albanian descent at the Massachusetts Institute of Technology, as well as anyone interested in learning more about Albanian culture and Albanians around the world.2.\tTo improve the well-being and MIT experience of Albanian and Albanian-American students at the Institute.3.\tTo provide a guidance network of current students and admitted Albanian students to facilitate the transition and increase the enrollment.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53009",
    "name": "MIT Asian American Initiative",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://asianamerican.mit.edu/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The Asian American Initiative strives, through action and education, to promote Asian American advocacy on the MIT campus and beyond. Our club aims to provide a safe space to discuss the building blocks and facets of Asian American identity, create a platform to bring light to issues affecting the Asian American community, and improve the Asian American experience on and off campus, while supporting other marginalized groups. Our club stands in solidarity and allyship with other marginalized groups, with founding beliefs against oppressive systems such as racism, homophobia, xenophobia, classism, ableism, and sexism.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53040",
    "name": "MIT Bridge Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://bridgeclub.mit.edu/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "To provide a platform for bridge lovers to play bridge weekly. To teach bridge to those who are interested.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53326",
    "name": "MIT Capital Partners",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/mitcap/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Capital Partners provides students with exposure to and preparation for careers in startups and venture capital, while fostering a diverse, supportive community. Through educational programming, mentorship, and real-world experiences, members gain a deeper understanding of how startups grow and how investors make decisions.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53283",
    "name": "MIT Climbing Team",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/ClimbingTeam/",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Climbing Club is to develop a community of undergraduate and graduatestudents who want to reach an advanced level of rock climbing. We support students by providingstructured practices and goal-oriented training programs. Our goals are to give this communityaccess to formal training, affordable climbing facilities, and opportunities to participate in formalcompetitions and fun outdoor activities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53393",
    "name": "MIT Democrats",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MITDems/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Democrats represents politically engaged members of the MIT community, including students, staff, faculty, and alumni, who generally support Democratic candidates for office, the advancement of progressive ideals in American politics, and the improvement of the Democratic Party.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52784",
    "name": "MIT Divest",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2487111_logo_103017828.png",
    "website_url": "https://www.mit-divest.com/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "Our goal is to get MIT to cut all ties with the fossil fuel industry, including but not limited to funding, research influence, and recruitment!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52715",
    "name": "MIT Energy and Climate Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2597995_MITEC_Logo_Full_Square_58104945.png",
    "website_url": "http://www.mitenergyclub.org/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Energy and Climate Club connects students, alumni, and community members who are passionate about energy and climate change. From 2004 to 2024, the Energy Club has been MIT's central platform for discussions about energy at the world's leading technical institute. In the Fall of 2021, we expanded our work to include not only energy but also the fight to combat climate change, and the intersection of these two subject areas. As the club with the largest reach on campus, we are a hub for thought-leadership and relationship building. Join our powerful community today.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": null,
    "name": "MIT Entrepreneurship Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2506243_Frame_1_919122019.png",
    "website_url": "https://engage.mit.edu/MITEC/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "We provide MIT students with a community of students who are currently founders or are dedicated to become founders at some point in the future. Additionally, we help connect MIT students passionate about entrepreneurship to opportunities to further their career in the world of startups.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52714",
    "name": "MIT Every Nation Campus (ENC)",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599125_ENC_MIT_logo_512134852.png",
    "website_url": "https://engage.mit.edu/ENC/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Welcome to Every Nation Campus – where open minds meet open hearts. We're a discussion-based Christian group open to all. Rejecting clichés, we dive into life's toughest questions while embracing our creativity. We believe in a God who made us not just to think, but to create, enjoy and have fun. Join us for lively discussions, warm fellowship, and weekly dinners.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53233",
    "name": "MIT Film Makers Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2503343_channels4_profilejpg_54164141.jpeg",
    "website_url": "https://engage.mit.edu/FMA/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Film Makers Association provides unprecedented opportunities of film production and artistic expression for MIT students, staff and alumni. We are a welcoming and loving community for cinephiles, movie critics, filmmakers and potential filmmakers at MIT, Harvard, and all other colleges/schools around Boston. We provide opportunities for members to create films, meet other creators, and learn more about filmmaking through events and workshops.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53344",
    "name": "MIT Flow",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/flow/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "Flow is a traditional Chinese dance team on MIT’s campus, established Fall 2023. We are dedicated to exploring and sharing the beauty of Chinese traditional, ethnic, and folk dance styles. Our goals are to provide a supportive community on MIT’s campus to learn diverse styles, as well as share traditional Chinese dance through performances within the MIT community and the greater Boston area.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53318",
    "name": "MIT Forecasting Group",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Forecasting/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of MIT Forecasting Group is to help the MIT community become more calibrated and better at forecasting future events.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53389",
    "name": "MIT Gala",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Gala/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Gala is a space to celebrate visual arts at MIT through an end-of-year event with a runway and art gallery, as well as supporting those in the MIT community interested in fashion through the process of designing and fabricating a piece to be shown off on the runway.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53341",
    "name": "MIT Georgian Society",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/mitgs/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to raise awareness about Georgia and Georgian culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52786",
    "name": "MIT Global Health Alliance",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://gha.mit.edu/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The ultimate mission of the MIT Global Health Alliance is to educate and advocate for health equity and social justice in a global context. We aim to do so via partnerships with local and international organizations and community educational campaign efforts. In particular, we engage with the community through boothing on MIT’s campus, hosting global health-related courses for MIT Educational Studies Programs, organizing panels with experts in the field, and biweekly presentations given to our club general body. Our international partnerships have focused on addressing specific areas of need identified in conjunction with organization stakeholders in the form of a sustained, multi-year project. Our club emphasizes the importance of long term commitments to communities and partnerships, and through our efforts we uphold our values of inclusivity, advocacy, empathy, and integrity.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52963",
    "name": "MIT Guild of Bellringers",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2486483_bellringers_logo_107102359.png",
    "website_url": "http://web.mit.edu/bellringers/www/index.html",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Guild is to promote and perpetuate the art of bell ringing and to provide an opportunity for its members to participate and improve in the group ringing of tower bells and hand bells.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": null,
    "name": "MIT Informatics Tournament Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2612634_MITITlogoroundsquared_Copy_11917570.png",
    "website_url": "https://mitit.org/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "We, the members of the MIT Informatics Tournament Club (M(IT)^2), in order to spearhead initiatives for the M(IT)^2 tournament, to foster a worldwide community of competitive programmers anchored at MIT, to establish a fair system of appointing leadership, and to give all members a voice in organizational matters, hereby ordain and institute this Constitution.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53330",
    "name": "MIT Israel Alliance",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2600541_Screenshot_20240421_at_100617PM_4212292.png",
    "website_url": "http://mitia.mit.edu/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Israel Alliance is to promote and advocate for the safety and freedom of the Jewish people, as well as the State of Israel, through educative action and cultural events within MIT and throughout Massachusetts.The MIT Israel Alliance will promote the above goal as consistent with MIT Policies Regarding Student Behavior and all applicable law.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53350",
    "name": "MIT Kendo Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/kendo/",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Kendo Club is to learn and practice kendo. Through the practice of kendo, we learn to mold the mind and body, cultivate a vigorous spirit, strive for improvement in the art of kendo, hold in esteem human courtesy and honor, associate with others with sincerity, and forever pursue the cultivation of oneself.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53090",
    "name": "MIT Latin Dance Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2502456_Latin_Dance_Club_logojpg_1230152526.jpeg",
    "website_url": "https://engage.mit.edu/ldc/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "To build a community of people who like Latin Dancing!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53305",
    "name": "MIT LIVE",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2491886_Branding_and_Style_Guide_copy_2_5421378.png",
    "website_url": "https://engage.mit.edu/MITLIVE/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT LIVE aims to provide a platform for MIT student musicians to arrange music, rehearse together, perform live, and showcase their talents. We welcome a variety of genres and instruments. Member can see their vision come to fruition through the delivery of a song during our end-of-semester showcases. Members may wish to start side projects, such as cover videos, original compositions, street performances, etc. and we will support them with our resources.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52780",
    "name": "MIT Minority Association of Pre-Medical Students",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_MAPS_Logo_Transparent_2_73115028.png",
    "website_url": "http://mitmaps.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the Minority Association of Pre-Medical Students (M.A.P.S.) shall be to address the needs of the minority pre-health students at the Massachusetts Institute of Technology. M.I.T.M.A.P.S. intends to motivate, encourage and prepare pre-health students from a disadvantaged background, an underrepresented minority group or a medically underserved area to be competitive applicants for health professional schools through a sharing of knowledge, experience and mentorship. The chapter is dedicated to serving underserved communities through a variety of community service activities and volunteering and to improve minority matriculation into all professional health related programs.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52799",
    "name": "MIT Model United Nations",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_mitmunclogo_73115105.png",
    "website_url": "https://mitmunc.org",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the MIT Model United Nations club is to create opportunities for students to develop their professional debate and research skills, applied in an engaging political and social context.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53400",
    "name": "MIT Nordic Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MNC/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Nordic Club aims to bring together Nordic students at MIT, foster a sense of community, and celebrate the Nordic cultures through events and gatherings.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52979",
    "name": "MIT Nritya",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2622037_IMG_3839jpg_128205946.jpeg",
    "website_url": "https://engage.mit.edu/Nritya/",
    "categories": ["Arts", "Cultural", "Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Nritya's mission is to foster a collaborative environment for Indian Classical Dance enthusiasts on campus to bond over their shared passion for dance. We hope to showcase the group's talent both through performances on campus and performances in the Greater Boston Area (and beyond) for the broader community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53403",
    "name": "MIT Pre-Law Society",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/PRELAWSOCIETY/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Pre-Law Society provides pre-law students with opportunities, resources, and a collaborative community to succeed in law school and legal careers. As one of MIT’s only law-focused student groups, we support aspiring lawyers through networking events, law school application assistance, and professional development initiatives.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52830",
    "name": "MIT QuestBridge Scholars Network",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2501515_MIT_CoBranded_Logo_9522921.png",
    "website_url": "https://www.questbridge.org/college-partners/massachusetts-institute-of-technology",
    "categories": ["Resources and Support"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT QuestBridge Scholars Network (QSN) Chapter is affiliated with QuestBridge (QB), a national non-profit organization that connects high-achieving, low-income high school students with admission and full scholarships to the nation’s best colleges. MIT’s QSN Chapter strives to create a supportive, engaging, and welcoming community for our 230+ QuestBridge Scholars who we often call Questies! Throughout the year, we arrange social events, foster friendships, and provide on-campus resources and mentorship.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53402",
    "name": "MIT ROTC Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MITROTCA/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT ROTC Association (MIT ROTCA) is dedicated to fostering a unified community for MIT students involved in ROTC across all programs. Our mission is to provide a student-led, cross-branch support network that promotes leadership development, mentorship, and camaraderie among cadets and midshipmen.MIT ROTCA serves as a bridge between ROTC students and the broader MIT community, facilitating interdisciplinary discussions, professional development opportunities, and outreach initiatives that enhance civil-military engagement on campus. Through collaborative events, service projects, and social gatherings, MIT ROTCA aims to strengthen the ROTC experience at MIT while providing an inclusive space for students interested in military service and leadership.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53343",
    "name": "MIT Saudi Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/ssa/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Supporting the holistic growth of Saudi students by advocating for their needs, celebrating our heritage, and providing essential resources for academic and professional success",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53080",
    "name": "MIT Science Policy Review",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_Screenshot_20240511_at_33351PM_731152848.png",
    "website_url": "https://engage.mit.edu/SPR/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Science Policy Review is a researcher-run publication founded in 2019 whose primary purpose is to publish accessible and authoritative science policy reviews authored by members of the broader scientific community for dissemination to the wider public. Additionally, the MIT Science Policy Review aims to be a resource for local, state, federal, and international policymakers who are involved in the creation and funding of science policies, especially those that are highly technical in subject matter.The Review is partially funded by MIT and the MIT Technology and Policy Program. The views and opinions expressed in publications are solely those of the authors and do not reflect the official position of MIT, the MIT Science Policy Review, or any affiliated/funding organization.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53053",
    "name": "MIT Student Veterans Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2021/s2_image_upload_2485872_SVALogo_818104238.png",
    "website_url": "https://vets.mit.edu",
    "categories": ["Resources and Support"],
    "organization_type": "ASA Student Organization",
    "mission": "To provide a supportive community for veterans and service members at MIT through direct advocacy, disseminating helpful information, and hosting social events.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53155",
    "name": "MIT Sustainability Summit",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2608591_Skjermbilde_20240513_kl_093017_51393030.png",
    "website_url": "https://engage.mit.edu/MITSS/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "To convene a diverse range of leaders –  from industry, academia, and students – and leverage MIT's unique interdisciplinary strengths to address pressing sustainability challenges.  Through collaboration and innovation, the Summit aims to empower participants to design and implement solutions that ensure a just, equitable, and thriving future for both humanity and the planet.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52795",
    "name": "MIT Sustainable Energy Alliance",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://www.mitsea.org/",
    "categories": [],
    "organization_type": "ASA Student Organization",
    "mission": "",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52980",
    "name": "MIT Ukrainian Folk Dance Ensemble",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2472053_smaller_notext_927204210.png",
    "website_url": "https://engage.mit.edu/Ufolk/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Ukrainian Folk Dance Ensemble aims to spread information about Ukrainian culture and heritage to the Boston and MIT communities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53292",
    "name": "MIT Wind Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://sites.mit.edu/wind/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Wind is to promote wind energy education and outreach within MIT and in the greater Boston community. The goal educational component of MIT Wind is to prepare students with the skills and connections to enter the wind energy industry. For undergraduate members, the centerpiece of MIT Wind is participation in the Department of Energy Collegiate Wind Competition (CWC), an annual event in which the objective is to build an operational model turbine to compete against other collegiate teams. Graduate students and non-student members in MIT Wind can serve as mentors to the CWC team. Additionally, all members join a network of professional connections to industry leaders, faculty, and renewable energy centers like the MIT Energy Initiative. MIT Wind facilitates networking events, wind farm site tours, and other professional development activities. Finally, MIT Wind serves as a platform for organizing K-12 educational outreach as well as community outreach regarding wind energy.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52797",
    "name": "MITALY - Italian Student Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_MITaly_Logojpg_8253327.jpeg",
    "website_url": "http://mitaly.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "At MITaly, we are a vibrant community of Italian students and scholars at MIT, united by a shared heritage and a passion for connection. Our mission is to celebrate and promote Italian culture, traditions, and values within the MIT ecosystem through social gatherings, cultural festivities, and academic networking. We strive to create a supportive environment where members can feel at home, forge lasting friendships, and collaborate across disciplines. By honoring our roots and embracing diversity, we aim to build bridges between Italy and the global MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53337",
    "name": "MITap",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/TAP/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "MITap is a tap company dedicated to spreading the art of tap dance on MIT’s campus and across the Boston/Cambridge area. We are committed to training in tap technique and performing tap dance.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53010",
    "name": "MITeri",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_logo_1_826644.png",
    "website_url": "http://mit.edu/miteri/www/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "1. To strengthen the Nepali community within MIT and the bigger Boston area2. To celebrate with and represent Nepali culture and traditions to MIT community members.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53019",
    "name": "MITVote",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2616925_logocrop_512203140.png",
    "website_url": "https://engage.mit.edu/MITVote/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "MITvote is a nonpartisan group of graduates and undergraduates with the goal of engaging an active voter community on campus. Our mission is to make voting as accessible as possible for everyone and encourage civic participation on MIT's campus.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53153",
    "name": "MITxHarvard Women in AI",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://mitharvardwai.github.io",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "We are a club of MIT and Harvard students who are interested in artificial intelligence and machine learning. We use an inclusive definition of the word women, and the purpose of the Women in Artificial Intelligence group is to provide a supportive community for cisgender women, transgender women, genderqueer women and individuals, and non-binary individuals pursuing studies or research in AI and machine learning at MIT and Harvard.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52789",
    "name": "MIXED",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MIXED/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "To provide a community for students who are of a mixed heritage and experience. We aim to create space for students to embrace their cultures and the complexities of the intersection of multiple identities, to increase awareness of the diversity of the mixed experience, and to discuss mixed issues.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53185",
    "name": "Mobin",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/mobin/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Mobin student group is to promote understanding of “Shia Islam”.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52982",
    "name": "Mocha Moves Dance Squad",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2488114_purple_mocha_logo_914171631.png",
    "website_url": "http://web.mit.edu/mochamoves/www",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "Established in 1999, Mocha Moves is an MIT-based dance team whose mission is to be a creative outlet for members to develop their skills. We share our talent and passion for dance through hosting performances, such as Ring the Alarm and Mocha Show, and participating in many others hosted throughout the Greater Boston Area. We strive to learn and grow together by cultivating our talents and connections with the Boston dance community. On Mocha, the grind never stops!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52948",
    "name": "Mock Trial Team",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://mitmocktrial.weebly.com",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Mock Trial is a student organization which competes under the American Mock Trial Association (AMTA). Members develop skills in public speaking, debate, legal understanding, acting, and more through tournaments throughout the year.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53237",
    "name": "Mongolian Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/Mongolian/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Mongolian Students Association's mission is to promote Mongolian culture at MIT. We’re determined to bring Mongolian students closer together and to support them through their journey at MIT, helping them through many challenges such as culture shock and homesickness.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52800",
    "name": "moveMENtality",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/moveMEN/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the moveMENtality is to create a space for male-identifying students to experiment with and explore dance at MIT. Our membership is composed of students who are interested in dance, whether or not they have had dance experience before college. We choreograph and practice a new performance each semester, and perform at showcases such as Ring the Alarm, Footwork, and DT Shows.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53011",
    "name": "Mujeres Latinas",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_mujeres_logo_8214722.png",
    "website_url": "http://web.mit.edu/mujeres/www/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "We are a group at MIT who focus on creating community for other Latinas at MIT. We want to promote service, knowledge, and identity to our community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52983",
    "name": "Muses",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_museslogowhite_82141420.png",
    "website_url": "http://muses.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Muses are an all-treble a cappella group comprised of students (both undergraduate and graduate) at MIT. The Muses sing a minimum of two concerts per year: one during the fall and another in the spring. Additionally we perform in two campus-wide performances each year, the Fall family weekend concert and the Spring CPW concert. We also sing at various gigs both on and off campus throughout the year. The Muses also do an annual fundraiser on Valentine’s Day in which we serenade various members of the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52802",
    "name": "Music Production Collaborative",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2510319_avatarsvDNP4lP70IcyN3lI9Abk7wt500x500jpg_1214155049.jpeg",
    "website_url": "http://mpc.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "We promote the collaboration, education, and exchange of ideas among MIT community members interested in all aspects of music production.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52803",
    "name": "Musical Theatre Guild",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2484609_MTG_Logo_2021_WhiteJPG_12514416.jpeg",
    "website_url": "https://mtg.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Musical Theatre Guild is the oldest and largest theatre organization at MIT, and we are entirely student-run! Formed from the merger of the MIT Gilbert and Sullivan Society, the Classical Musical Society, and the Tech Show Society in 1971, we produce a wide variety of Musical Theatre. We perform four shows a year so there is plenty of opportunity to act, sing, dance, tech, design, direct, and produce. So, if you want to be part of a great art form, come investigate MTG!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52905",
    "name": "Muslim Students Association",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_alchemist_final_82143229.png",
    "website_url": "http://msa.mit.edu/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Muslim Student Association (MSA) seeks to foster a welcoming, spiritually enriching, and intellectually vibrant community for Muslims and non-Muslims alike at MIT. We are dedicated to supporting the religious, academic, and personal development of students through inclusive programming that reflects the values of Islam. Our mission is to cultivate meaningful spaces for worship, dialogue, learning, and social engagement, while striving to build bridges of understanding between Muslims and the broader MIT community. Through service, mentorship, and collaboration, we aim to empower Muslims at MIT and positively contribute to the Institute and the greater Boston area in a manner rooted in Islamic principles and guided by the prophetic tradition​.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52804",
    "name": "National Society of Black Engineers",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://nsbe.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "To increase the number of culturally responsible Black Engineers who excel academically, succeed professionally and positively impact the community",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53171",
    "name": "Native American & Indigenous Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/NAIA/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Native American & Indigenous Association seeks to provide social, political, cultural and academic support for Massachusetts Institute of Technology undergraduate and graduate students of Native American descent and Native student allies. NAIA allows Native American students to connect with similar students through their cultural history and individual experiences as Indigenous people. This goal encompasses the development of members as future leaders and mentors of Native Americans and will provide a network to allow discussion and innovative problem solving on the issues faced by Indigenous peoples. NAIA also seeks to educate the MIT community on facets of Native American life and ensure that the community and its leadership maintain MIT as an equitable and secure place for Native American students and all students of color.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52809",
    "name": "Next Act",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://nextact.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Next Act shall be to produce and present an annual full-length musical production during MIT’s Campus Preview Weekend (CPW) and to serve as a portal into the world of musical theater for veterans and beginners alike. Anyone who auditions for a Next Act production is guaranteed to be cast in a speaking and/or singing role, regardless of experience.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53189",
    "name": "Next Sing",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_logo_82171326.png",
    "website_url": "https://engage.mit.edu/NextSing/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Next Sing is to provide a fun, noncompetitive, low commitment music activity for all MIT students interested in music. We welcome all musicians––singers and instrumentalists, undergrads and grad students––to join! We accept people of all skill levels and backgrounds. Our musical acts all involve vocalists and sometimes instrumentalists.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53229",
    "name": "Ninja Warrior Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/NWC/",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "Our club intends to bring an alternative sport to MIT.MIT ninja warriors will train for ninja warrior obstacles such as those straight from the American Ninja Warrior Obstacle courses. It is for both beginners who want to maintain fitness and have fun learning cool tricks and obstacles, as well as the more experienced ninja whose goal is to train ninja competitively.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52984",
    "name": "Ohms",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_Ohms_Logo_Square_82173010.png",
    "website_url": "http://web.mit.edu/ohms/www/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "To celebrate our love of South Asian culture and music across the world by writing and performing fusion a capella arrangements.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53310",
    "name": "Open Discourse Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2613079_ODS_92513512.png",
    "website_url": "https://engage.mit.edu/mods/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Open Discourse Society (MODS) is to cultivate civil discourse and intellectual diversity within the MIT community. MIT is the global STEM epicenter, and for so long, advancements in science and technology here and elsewhere have stemmed from the willingness to engage in productive discussions and good-faith evaluation of ideas.MODS aims to recreate environments where such discussions and evaluation are the norm and devoid of bigoted obloquy. Such environments range from speaker events and panel discussions to roundtables and workshops to networking events that connect students with professionals who have taken a stand for free speech.In this era where censorship and crackdowns dominate, it is more important than ever to uphold the integrity of open inquiry that is embedded within MIT's long-standing tradition of creativity and curiosity and the broader nature of the scientific process. MODS exists precisely for this purpose.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53329",
    "name": "OpenCode Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2466712_crow_logo_1116212857.png",
    "website_url": "https://engage.mit.edu/OpenCode/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "Elevate open source culture within MIT and break down obstacles to information and technology",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52816",
    "name": "OrigaMIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://origamit.scripts.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of OrigaMIT is to provide current origami artists a place to meet others who share the same passion, and to provide new or interested folders an opportunity to learn.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53108",
    "name": "Origins",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2609177_logo_322111455.jpeg",
    "website_url": "https://engage.mit.edu/Origins/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission at MIT Origins is to foster holistic well-being within the MIT community by offering a diverse range of activities, including yoga, Vedic spiritual wisdom, nourishing dinners, spiritual festival celebrations, enriching workshops, engaging weekly discussions, retreats, and more. We are committed to nurturing the body, mind, and spirit, guiding individuals towards greater fulfillment and balance in their lives.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53247",
    "name": "Orthodox Christian Fellowship of the Massachusetts Institute of Technology",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/OCFMIT/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is 1) to be the loving presence of Christ and the Orthodox Christian Church on college campuses, 2) to be an integral part of students’ spiritual formation by challenging them to explore the Faith, 3) to inspire students to commit to living an Orthodox Christian way of life daily.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53244",
    "name": "OSU!MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/OSU/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of osu!mit is to share interest in the free-to-play music game osu!, to provide a friendly environment for students to connect with others outside of academics, and to motivate and compete in various tournaments within the game such as the \"osu! Collegiate League\". The osu! community at MIT is special because of our derived, shared interest in topics such as different genres of music, interactive music systems, and level design.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52817",
    "name": "Outing Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://mitoc.mit.edu/",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of MITOC shall be to create a safe community around outdoor recreation and to provide students with the education and means to use, enjoy, and explore the great outdoors.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52818",
    "name": "Palestine at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://palestine.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "At Palestine@MIT, we are dedicated to promoting the Palestinian heritage, tradition and culture. We embrace our identity and our values are rooted in the our rich history of striving for freedom and liberation. We believe we own tomorrow. Tomorrow is a Palestinian day.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53375",
    "name": "Paraguayan Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/paraguay/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Paraguayan Association is to provide a welcoming and supportive community for current Paraguayan students, creating a home away from home. The club promotes Paraguayan culture within MIT through events, cultural exchanges, and fostering a sense of unity among Paraguayan members. It aims to increase awareness of Paraguayan traditions and values, while offering a network of mutual support, academic collaboration, and personal growth for its members.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53123",
    "name": "PLEASURE at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://pleasure.mit.edu/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "PLEASURE is a student group at MIT supported by the Violence Prevention &Response (VPR) office and the Office for Student Wellbeing (OSW) that aims toimprove how our communities navigate sex and relationships in order to end sexual andall forms of identity-based violence through peer education.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53028",
    "name": "Pokemon League",
    "logo_url": "https://engage.mit.edu/upload/mit/2021/s2_image_upload_2480601_MITPL_logo_819184635.png",
    "website_url": "http://web.mit.edu/pokemon/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of MIT Pokémon League is to (1) promote an MIT studentcommunity that appreciates and plays a variety of Pokémon games and (2)establish a Pokémon League at MIT, which will be officially recognized by thePlay! Pokémon organization.",
    "membership_info": "$0 (Standard)Membership will end on 30 May 2029"
  },
  {
    "id": "52825",
    "name": "Poker Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://poker.mit.edu/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of this club is to create a community with like interests and also create a better understanding in the game of poker.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52826",
    "name": "Pokerbots",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://pokerbots.mit.edu/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "Pokerbots' main purpose is to run the annual MIT Pokerbots class and competition during IAP, including teaching all of our students and securing sponsorship funding for the competition prizes.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53369",
    "name": "Polish Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2025/s2_image_upload_2609457_Logo_Higher_Resolutionjpg_128142748.jpeg",
    "website_url": "http://polishclub.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Bringing Polish culture and community to MIT – celebrating traditions, fostering connections, and sharing opportunities for cultural engagement.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52827",
    "name": "Polymer Graduate Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://polymerscience.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the Polymer Graduate Student Association (hereafter referred to as PGSA) is to facilitate social and academic interaction among PPSM (Program in Polymer Science and Soft Matter) students, as well as promote the well-being and vitality of the program to maintain its status as a forum for interdepartmental polymer research.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52950",
    "name": "PreMedical Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2501853_mpslogoround_914171856.png",
    "website_url": "http://www.mitpremedsociety.com/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Foster community within pre-health students at MIT and prepare members for a career in medicine.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53048",
    "name": "ProLife",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/Pro-Life/www/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Pro-Life Club is focused on spreading awareness about the risks about abortion, about the philosophies against abortion, providing resources to women who are considering getting, currently getting, or have gotten an abortion. The MIT Pro-Life Club is also focused on working with local and national organizations that assist in the aforementioned efforts.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53027",
    "name": "Puzzle Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_pc_logo_82143918.png",
    "website_url": "https://www.mit.edu/~puzzle/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the organization is to promote interest and participation in puzzles on campus, through solving and writing puzzles, as well as running various events and meetings throughout the year. The flagship event is the annual MIT Mystery Hunt (“the Hunt”), a weekend long activity held during IAP in which teams of participants compete to solve a variety of puzzles and find a coin hidden on campus.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52952",
    "name": "Quiz Bowl Team",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://quizbowl.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Quiz Bowl Team is an organization of MIT undergraduate and graduate students who compete in and host academic trivia (i.e. quizbowl) competitions. The purpose of the MIT Quiz Bowl Team is to promote and encourage participation in quiz bowl events, academic competitions, and trivia games, and the accumulation of trivial knowledge; to host on-campus and interscholastic quiz bowl tournaments; and to recruit, train, and support the quiz bowl teams which represent MIT in intercollegiate competition.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53059",
    "name": "Radio Society W1MX",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2503500_HT_Seal_Circular_Youtubesvg_92917455.png",
    "website_url": "http://w1mx.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Society shall be to gather together the students of MIT having an interest in amateur radio. The Society will endeavor to maintain an HF (Below 30MHz) Amateur Radio Station for the use of its members, both in individual activities and with the intent of promoting the image of MIT throughout the world via amateur radio.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53285",
    "name": "Reading for Revolution",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/ReadingForRevolution/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "Reading for Revolution (R4R) is a group of students at MIT seeking to understand the contemporary conditions of America, its geopolitical relations with the world (particularly the ‘Global South’), and our responsibility as citizens, students, and engineers to create a more just and human-oriented society. In our meetings, we discuss questions such as: how do we develop a culture which prioritizes the inherent right of all people to a decent livelihood? What is true democracy? What is the role of technology and art in advancing the freedom struggle? We look for answers through studying the revolutionary life and legacy of figures such as W. E. B. Du Bois, Martin Luther King Jr., Grace Lee and James Boggs, James Baldwin, and Malcolm X, as well as global liberation movements which sought to free humanity from imperialism, poverty, and all other forms of exploitation. Through speaker events and collaborations with other MIT political and cultural groups, we seek to bring discussions of these questions to light within the broader MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52832",
    "name": "Reformed University Fellowship",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.ruf.org/mit",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "RUF is a community that is committed to considering the good news of Jesus together. We seek to be an authentic community that is supportive, spiritually challenging, and outward facing to our peers on campus. RUF is a safe place to ask questions, voice doubts and explore Christianity with other students at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52985",
    "name": "Resonance of MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://resonance.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of The Resonance of MIT is to provide an outlet to sing a cappella non-competitively at MIT. The Resonance will strive to maintain a low key and fun atmosphere. We will keep required time commitment to such a level as to allow members to be active participants in other activities (especially performance groups) at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53021",
    "name": "Ribotones",
    "logo_url": "https://engage.mit.edu/upload/mit/2021/s2_image_upload_2488430_ribotones_logo_finaljpg_91110140.jpeg",
    "website_url": "http://ribotones.mit.edu",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Ribotones is a music service group that aims to use music as a means of community service in the greater Boston community and beyond. We are string/piano/wind players, vocalists, and chamber groups (e.g., trios, quartets, sextets, octets) who love to play volunteer recitals at local venues such as hospitals, nursing homes, long-term care facilities, and more, delivering quality music to the residents. Our primary goal is to bring the joy of music free of charge to those who may have limited access to live performances, no matter their prior experience with music.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52833",
    "name": "Ridonkulous",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2484609_Asset_24x_61234952.png",
    "website_url": "http://ridonk.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "Established in spring 2005, Ridonkulous is an urban dance crew whose goal is to bring MIT dance to other venues in the greater Boston area and to express our passion and commitment to teamwork and dance. In addition to performing at charity events, collegiate showcases, and competitions across the Greater Boston area, we host our own annual showcase, Footwork. Our mission is to have fun, dance, and show the world why we are so RIDONKULOUS!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52986",
    "name": "Roadkill Buffet",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://roadkill.mit.edu",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "An Improv Comedy troupe which exists to bring joy to the MIT community through our public and free performances, as well as to improve and enhance the craft of our troupe members.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53061",
    "name": "Robotics Team",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://www.facebook.com/MITRobotics",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Robotics Team is a group of highly motivated undergraduate students from the Massachusetts Institute of Technology. Our diverse group, with majors ranging from Mechanical Engineering to Business Analytics, shares a common passion for the field of robotics. The team’s purpose is to explore exciting new technologies, learn critical skills, and promote the field of robotics through entering a variety of competitions and engaging in outreach events in the wider community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52835",
    "name": "Rocket Team",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://rocketry.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "We will design, build, test, launch, and recover a rocket — flying an engaging scientific experiment — beyond the Kármán Line.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52836",
    "name": "ROCSA",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2504193_Vertical_logo_blk_1030172524.png",
    "website_url": "https://mit-rocsa.gitbook.io/rocsa-student-handbook/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "ROCSA (stands for Republic of China (Taiwan) Student Association) is the official graduate student organization of Taiwanese students at MIT. We host events for students who share common cultural roots and help promote Taiwanese culture to the entire student community. Our mission is for students from all backgrounds to share their interests and roots, help promote the Taiwanese culture to those who are interested, and connect the members of the MIT Taiwanese student community.",
    "membership_info": "$30 (1 Year)Membership will end on 31 May 2026"
  },
  {
    "id": "53092",
    "name": "Romanian Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.mit.edu/~romania/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the Romanian Student Association is to bring together Romanianstudents at MIT and give them a place to celebrate their culture, as well as introduce other members of the MIT community to Romanian culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52994",
    "name": "Rune",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://runemag.mit.edu/html",
    "categories": ["Publication"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to provide a creative and artistic outlet for the MIT community to showcase and publish their work.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52837",
    "name": "Russian Connection",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/RusCon/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Russian Connection is to unite and bring the MIT Russian-speaking community as well as anyone interested in experiencing Russian/Eastern European culture together outside of research.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52838",
    "name": "Sakata Afrique",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://sakata.mit.edu",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Sakata Afrique is to help MIT students of African and Caribbean originor descent preserve their cultural heritage through music and dance, and to introduceAfro-Caribbean dance to the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": null,
    "name": "Sangam",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://sangam.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "1. Enriching the MIT environment with the culture and traditions of the Indian subcontinent.2. Providing forums for both learned and casual discussion of issues relevant to the subcontinent and the people whose roots are there.3. Working with MIT and our partner organizations to ensure that the total needs of the General Sangam Body are met.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53055",
    "name": "SaveTFP",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://savetfp.mit.edu",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "SaveTFP is committed to reducing stress and facilitating student social activities while increasing health awareness and curbing dangerous behaviors at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53219",
    "name": "Scholars of Finance",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://scholarsoffinance.org",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Scholars of Finance is to develop the next generation of highly capable financial executives, who will act and lead from a strong grounding in principles and ethics.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52810",
    "name": "Science Bowl",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://www.mitsciencebowl.com/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of MIT Science Bowl is to promote science education and exposure to the K-12 community via the organization of at least two buzzer-style competitions. These competitions are the Fall Invitational, catering to high-school teams across the nation, and the Spring Regional, the official National Science Bowl regional competition for the Northeast Region.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53295",
    "name": "Science Club for Girls at MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2478854_SCFG_logowhitewebp_9717192.jpeg",
    "website_url": "https://engage.mit.edu/SCgirls/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Science Club for Girls at MIT is to foster excitement, confidence, and literacy in STEM for girls and gender-expansive youth from underrepresented communities by providing free, experiential programs and by maximizing meaningful interactions with women-in-STEM mentors. Girls work with mentor-scientists who model and foster leadership and promote careers in science and technology as goals and options.  Science Club for Girls will work to create a community of MIT undergraduate and graduate students dedicated to serving local Cambridge and Boston schools and generating enthusiasm for science through after school and extracurricular activities. Science Club for Girls fulfills a need at MIT for a volunteering opportunity that empowers future women scientists, and it fulfills a need of the Cambridge community for free and educational after school opportunities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52839",
    "name": "Science Fiction Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2612882_mitsfs_logo_58122149.png",
    "website_url": "http://mitsfs.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The primary purpose of the Society shall be the maintenance, operation, and expansion of the Society's library of speculative fiction. The secondary purpose of the Society shall be to encourage academic and social activities related to speculative fiction, and to provide a forum for such activities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52840",
    "name": "Science Olympiad at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://scioly.mit.edu/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "Science Olympiad at MIT is a group of undergraduate students that organizes an annual Science Olympiad invitational as an alumni chapter of the National Science Olympiad organization. We provide around 1000 high school students with the opportunity to engage in a variety of topics in science and engineering.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52841",
    "name": "Science Policy Initiative",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://spi.mit.edu",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Science Policy Initiative, founded in 2007, is a group of postdocs, graduate, and undergraduate students who work closely with the MIT DC Office and other science policy advocates to foster discourse between the scientists of tomorrow and policy-makers of today.We believe that early career scientists and engineers can benefit by learning about and engaging with the world of science policy and legislation, and provide opportunities and resources to do so. Postdocs and students in our programs not only learn how our national leaders make and legislate their science policies, but also get valuable on-the-Hill advocacy experience.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53334",
    "name": "Scuba Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/scuba/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Scuba Club aims to provide a central hub for students, faculty, staff, and other members of the Boston area interested in scuba diving to interact, plan dive trips, and foster their knowledge of underwater exploration.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52987",
    "name": "Shakespeare Ensemble",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2507732_Screenshot_20230914_184342_914184413.png",
    "website_url": "https://ensemble.mit.edu",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Shakespeare Ensemble is a self-sustaining community dedicated to bringing the works of Shakespeare and other playwrights to life. We are a group of students and community members who are committed to forming an open and fun-loving team focused on learning the various aspects of theater. We share a common interest in the idea of the theater ensemble: a group of people who work together on a long-term basis to produce shows.Everyone is welcome to come learn and explore with us, from first time techies to experienced actors. The Ensemble performs four mainstage shows every year during the fall term, IAP, the spring term, and the summer. Our term shows are usually Shakespearean plays directed by a hired professional director. The IAP and summer shows are usually student-directed, and we often branch out to other playwrights. We also perform Scene Nights (performances of short scenes from any play) and 24 Hour Shows (during which we write and rehearse a show all within 24 hours!) the year. Everything from acting to tech is entirely student-run, creating an excellent atmosphere in which to try your hand at new skills.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52843",
    "name": "SHINE for Girls",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/SHINE/",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "Our goal is to promote both academic and artistic development in young girls and non-binary students through mentoring math, dance, and creative arts.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52844",
    "name": "SIAM",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/siam/www/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT SIAM (Society for Industrial and Applied Mathematics) chapter is to engage the diverse MIT community with a shared interest in Applied Mathematics and Computational Science. We seek to further SIAM’s mission to bridge the world of mathematics with that of science and technology. Our group aims to encourage interdisciplinary collaboration, and facilitate exchange of ideas and scientific results.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53095",
    "name": "Singapore Students Society",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://mitsss.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Singapore Students Society, hereinafter referred to as the “Society,” is a solely cultural club with the following purposes: to foster friendship among students interested in Singapore culture and to promote cultural exchange between Singapore students at MIT and students from other countries in Massachusetts.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52848",
    "name": "Sloan Business Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.mitsbc.org/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Sloan Business Club (SBC) empowers students with the skills, network, and experience to excel in finance, consulting, and entrepreneurship.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53180",
    "name": "Smash UltiMIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/SUMIT/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Smash UltiMIT is to maintain a centralized community of competitive Super Smash Bros players by hosting tournaments.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52849",
    "name": "Society of Hispanic Professional Engineers",
    "logo_url": "https://engage.mit.edu/upload/mit/2021/s2_image_upload_2489101_shpe_831104642.png",
    "website_url": "http://shpe.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "SHPE (Society of Hispanic Professional Engineers) is a nonprofit organization serving and advancing Hispanics in STEM. With more than 13,000 student and professional members, SHPE’s mission is to change lives by empowering the Hispanic community to realize its fullest potential and to impact the world through STEM awareness, access, support, and development. To accomplish this, SHPE provides a variety of programming, services, resources, and events, including hosting the largest Hispanic STEM convention in the nation.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52953",
    "name": "Society of Physics Students",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://sps.scripts.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "To provide information and service in the interest of the members of MIT community who are interested in physics and to encourage interaction between undergraduate students, graduate students, faculty, staff, and other members of MIT community interested in physics.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52852",
    "name": "Society of Women Engineers",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://swe.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Society of Engineers was founded in 1979. Since then, MIT SWE has strived to inspire younger generations about engineering, encourage the notion of diversity in engineering, and determine and advocate for the needs of women engineers at MIT and the broader community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52854",
    "name": "South Asian Association of Students",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://saas.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT's South Asian Association of Students (SAAS) is one of the largest groups on campus, dedicated to promoting South Asian culture and creating spaces for students of South Asian descent at MIT. SAAS is open to all students interested in getting a taste of South Asian culture. Our organization was founded with the purpose of celebrating the diversity of South Asian culture and providing spaces for discourse and community among people with ties to that culture. SAAS provides space to celebrate South Asian culture in big ways, engage in discourse about that culture and the ways it affects our society, and to bond with other community members over shared experiences, values, and traditions. Through this, we hope to create a more positive and impactful South Asian presence at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53346",
    "name": "South Slavic Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/slavic/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the SSA is to be a home for all students with either an interest in South Slavic culture and history, or students with a South Slavic background interested in connecting with other South Slavs. The SSA aims to connect the many American South Slavs, International South Slavic students, as well as friends and generally interested students in the culture. The group will work to be a source of connection in a network of such students and promote student mental health and interaction the through organization of cultural events.The group will aim at all times to remain a positive, open, and supportive atmosphere based on understanding the cultural complexities of the South Slavic and general Balkan region, as well as first and foremost promoting unity through wonderful food, music and dances.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53323",
    "name": "Southeast Asia Society",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/SEAS/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of the MIT Southeast Asian Society is to foster positive professional and personal relationships between its members and the various Southeast Asian country societies through social events and to raise awareness of the culture and opportunities in the Southeast Asia region to the entire MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53112",
    "name": "Spain at MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599885_Spain_MIT_Logo_final_81625930.png",
    "website_url": "http://spain.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "To bring the Spaniards at MIT together, and to share their culture with the rest of the MIT community",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52856",
    "name": "Spinning Arts Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://spinning-arts.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Spinning Arts Club is to provide students with a venue in which to learn and practice prop spinning for both fire and glow props, as well as access to instruction in both performance and safety with fire.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52857",
    "name": "Sporting Clays Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/sportclays/",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Sporting Clays Association is a competitive shotgun shooting team. We practice on flying targets in the disciplines of Skeet, Trap, and Sporting Clays. The sport takes a tremendous amount of discipline and helps members to improve their mental focus as well as hand-eye coordination. Additionally, the club teaches its members how to safely and respectfully handle firearms while introducing them to a sport that plays a significant role in American culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53173",
    "name": "Sri Lankan Students Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/srilanka/www",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The Sri Lanka Student's Association at MIT is dedicated to fostering a vibrant community that celebrates and promotes Sri Lankan culture while nurturing a supportive environment for its members. Our mission is to cultivate cultural awareness, facilitate open dialogue and connection among Sri Lankan and non-Sri Lankan students, and provide unwavering support for Sri Lankans at MIT. Through diverse events, discussions, and support initiatives, we aim to enrich the MIT experience for all members, promote cross-cultural understanding, and contribute positively to the campus community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53013",
    "name": "Stammtisch",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://mit.edu/stammtisch/www/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Stammtisch is a club dedicated to bringing together those who share an interest in the German language and culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53248",
    "name": "Stand-Up CoMITy",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2484600_insta_logo_429153359.png",
    "website_url": "https://engage.mit.edu/SCMIT/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Stand-Up CoMITy is to promote student mental health and wellbeing through comedy, as well as provide a platform for students and staff to ideate, write, and perform stand-up comedy as a means of self-expression.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52954",
    "name": "StartLabs",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://startup.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Foster the next generation of technical entrepreneurs by helping MIT students learn about startups and launch innovative ventures.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52859",
    "name": "Strategic Games Society",
    "logo_url": "https://engage.mit.edu/upload/mit/2021/s2_image_upload_2517196_MIT_SGS_Logo_101145720.png",
    "website_url": "http://www.mit.edu/~sgs/",
    "categories": ["Games and Puzzles"],
    "organization_type": "ASA Student Organization",
    "mission": "At MIT SGS (Strategic Games Society), our mission is to unite board game enthusiasts from MIT and the Boston-Cambridge area. Our focus lies in having fun, fostering connections, and ensuring that MIT SGS continues to be the longest-standing board game club at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52862",
    "name": "Student Information Processing Board",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2471539_grumpyfuzzball_half_32923225.png",
    "website_url": "https://sipb.mit.edu/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to provide students with improved access to computational facilities; to serve as an advocate for the MIT Community to the Faculty and the Administration in computer-related topics; to function as an information center for members of the MIT Community interested in topics in computer science or computing; to conduct, manage, and support experiments run by students to advance the techniques of organization, planning, and administration of access to computers; and to initiate, develop, and provide computer services deemed valuable to the MIT Community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52863",
    "name": "Student Juggling Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/juggle/www",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "1. To educate students about the art of juggling.2. To provide students with the chance to learn from other jugglers.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": null,
    "name": "Student Sustainability Coalition",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2470198_SSC_Logo_BlackText_51120391.png",
    "website_url": "https://ssc.mit.edu/",
    "categories": ["Resources and Support"],
    "organization_type": "ASA Student Organization",
    "mission": "Established in the summer of 2020, the Student Sustainability Coalition (SSC) congregates student sustainability-related groups at MIT, facilitating communication, collaboration, and collective action. Given the diversity of student sustainability organizations and opportunities on campus, we aim to act as a centralized overarching organization, making connections between groups and elevating the student voice.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52867",
    "name": "Students for the Exploration and Development of Space",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://seds.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "SEDS is an independent, student-based, student-run organization which promotes the exploration and development of space. SEDS pursues this mission by educating people about the benefits of space, by supporting a network of interested students, by providing an opportunity for members to develop their leadership skills, and inspiring people through our involvement in space-related projects. SEDS believes in a space-faring civilization and that focusing the enthusiasm of young people is the key to our future in space.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53314",
    "name": "Students of Open and Universal Learning",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2491758_Screenshot_20240522_at_103913AM_522103952.png",
    "website_url": "https://engage.mit.edu/SOUL/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of SOUL is to accelerate, experiment with, and build a stronger culture of open education at institutions of higher education, starting with MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53404",
    "name": "Sudanese@MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/MITSUDANESE/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "Sudanese@MIT is a group that focuses on connecting the MIT Sudanese community to the wider student body, Sudanese alumni, and the greater Boston/Cambridge area. We aim to create a space where Sudanese students can share their culture and connect with their peers.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52868",
    "name": "Swara",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599145_Logojpg_512155045.jpeg",
    "website_url": "https://engage.mit.edu/Swara/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Swara is the Indian Classical Music Group at MIT with a focus on South Indian Carnatic music. We gather weekly to jam together and learn new pieces collectively out of a shared passion for this unique style of music. We welcome people at all levels to learn and perform together, both at MIT events and at event we organize for the MIT community. Our mission is to connect musicians at MIT to each other and to the thriving Carnatic music ecosystem in the greater Boston area.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": null,
    "name": "Syncopasian",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.syncopasian.com/#/home",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "Syncopasian is a co-ed a-cappella group at MIT with an emphasis on modern East Asian music. Since our founding in Spring 2008, we have put on many successful performances while supporting a vibrant and cross-cultural space for our members and audiences. Our goals as a group are as follows: (1) to sustain our musical presence by recording and producing music videos, and (2) to raise awareness for East Asian music and culture, both within MIT and the Greater Boston/Cambridge community",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53335",
    "name": "Taara",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2488377_Taara_logo_small_512225629.png",
    "website_url": "https://engage.mit.edu/taara/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "Taara (meaning: Star) aims to provide a dynamic platform that empowers and elevates the voices of South Asian women, femme, and gender non-conforming students at MIT. Through advocacy, activism, and action, we are committed to challenging systemic barriers that hinder our access to opportunity, representation, and well-being.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53077",
    "name": "Tango Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2468364_logo_final2_331104323.png",
    "website_url": "http://tango.mit.edu/",
    "categories": ["Arts", "Cultural", "Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT Tango Club is promoting Argentine Tango to the MIT Community. We offer classes, practice sessions (called \"practicas\"), introductory bootcamps, and workshops at heavily discounted prices for MIT students.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53109",
    "name": "Tech Catholic Community",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://tcc.mit.edu/www/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Vision:  A vibrant, Catholic community at MIT empowering leaders in faith and science.  Mission:  Welcome, Grow, Worship",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52871",
    "name": "Tech Model Railroad Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://tmrc.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Club shall be to increase the awareness of model railroading among M.I.T. students and other members of the M.I.T. community. The Club shall organize and administer facilities to promote the hobby and encourage the participation of the M.I.T. community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52872",
    "name": "Tech Squares",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.mit.edu/~tech-squares/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "Tech Squares is a square dance and round dance group at MIT. We dance Plus squares and Phase II to V rounds once a week in addition to other events.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53311",
    "name": "Technicolor Furs",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2471539_TechnicolorFurs_Logo_1_123234946.png",
    "website_url": "https://engage.mit.edu/TechFurs/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Technicolor Furs is:- To provide a welcoming environment for everyone in the MIT community to discuss, share, and participate in various aspects of the furry fandom- To promote awareness and appreciation of furries",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52996",
    "name": "Technique Yearbook",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2495433_grogo_prub2jpg_10711533.jpeg",
    "website_url": "http://technique.mit.edu/",
    "categories": ["Arts"],
    "organization_type": "ASA Student Organization",
    "mission": "Founded in 1885, MIT Technique aims to provide a venue for students' creative expression through photography and design, connect student photographers with events and opportunities around campus, and document student life as part of its award-winning yearbook.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52873",
    "name": "Technology Policy Student Society",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/TPSS/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "In order to study and discuss issues in technology policy seminars, provide information about careers, engage in a dialogue with invited speakers, and participate in a community of open-minded students, we hereby form the Technology Policy Student Society (hereafter TPSS).",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52874",
    "name": "TechSec",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://reverse.mit.edu/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission statement of TechSec is to provide MIT students a safe haven to learn and cultivate theirknowledge on cybersecurity.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53062",
    "name": "TechX",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2503163_techxbanner_v2_1030171912.png",
    "website_url": "https://techx.io/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT TechX student organization is to promote knowledge of technology and of the tech industry.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52875",
    "name": "TEDxMIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.tedxmit.org",
    "categories": ["Education"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of TEDxMIT is to organize and hold TEDx conferences to showcase the diverse perspectives of the MIT community. By inviting a wide variety of speakers to share their stories and talents, we hope to create an environment where students, faculty, and community members alike can learn from each other in a non-traditional setting.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53096",
    "name": "Thai Students at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/tsmit/www/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Thai students at MIT is to promote understanding of the Thai heritage and interaction among Thai students. The organization provides a comfortable space for all Thai students at MIT through different seasonal and cultural activities to make the community like home. Thai students at MIT also serve as a social network of Thai students as will bring Thai students from different universities in the Boston area together through the biannual event we organize every year. .",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53250",
    "name": "The Bike Lab",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/TBL/",
    "categories": ["Community Service"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Bike Lab is a student-run bike collective that provides services to the MIT community. Studentsvolunteer as mechanics to assist others with bike repair and maintenance. All members of thecommunity are welcome, and access to tools and advice is completely free of charge. The shop hasmost of the tools needed to complete basic repairs. The club is also an opportunity for people tobuild community around biking and safety, and for mechanics to hold educational workshops formembers of the community. The shop has been running for 2 months now. Currently, the shop is openon Fridays from 2-5PM outside Building 13. There are four active volunteer mechanics, and there aretypically 10-15 customers who come to open hours for assistance.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52876",
    "name": "The F Word",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/stop/www/",
    "categories": ["Activism"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Monologues are an annual production put on by the F-Word @ MIT, centering marginalized and underrepresented identities’ experiences around gender, sexuality, physical / mental / emotional health, ethnicity, and more. if you have a story you would like to share, we would love to have you!",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52997",
    "name": "The Tech",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://thetech.com/",
    "categories": ["Publication"],
    "organization_type": "ASA Student Organization",
    "mission": "Providing MIT faculty, staff, and students with continuous news service since 1881.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53302",
    "name": "Thirsty Ear Programming Committee",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2509764_earlogojpg_32214519.jpeg",
    "website_url": "https://thirsty-ear.mit.edu/",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Thirsty Ear Programming Committee (TEPC fka TEEC) is to provide student input and leadership for the Thirsty Ear Pub (TE).",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52989",
    "name": "Toons",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2471158_toonsprofilejpg_929194627.jpeg",
    "website_url": "http://toons.mit.edu/",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "To provide a co-ed a cappella group with members from the Wellesley College and MIT communities.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52879",
    "name": "Traders at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://traders.mit.edu",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "We partner with leading industry sponsors annually to host the largest intercollegiate trading competition in the country. In addition, we organize seminars and events to prepare students for successful careers in quantitative trading and finance.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53345",
    "name": "TransMIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/trans/",
    "categories": ["Gender and Sexuality"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of TransMIT is to support the trans and gender expansive (i.e. identities including but not limited to: transgender, transsexual, gender non-conforming (GNC), genderqueer, two-spirit, agender, non-binary, and gender questioning) community at MIT. TransMIT will fulfill this purpose by:-Developing and hosting programming to further the social and professional development of its members,-Raising awareness of the existence and experiences of trans and gender expansive individuals at MIT,-Collecting and sharing resources that are relevant to the needs of the trans and gender expansive community at MIT,-Serving as an advocate for the needs of all trans individuals affected by MIT policy.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53097",
    "name": "Turkish Student Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://tsa.mit.edu/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "We are a group for all Turkish students and students interested in Turkish culture and Turkey. We host events pertaining to Turkish culture.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52884",
    "name": "UHF Repeater Assn W1XM",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2503500_W1XM_Logo_by_Anika_Huang_20220911_92917641.png",
    "website_url": "http://web.mit.edu/w1xm/www",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "To engage with experimental radio technology in VHF, UHF, and beyond. Maintains an electrical engineering and radio-focused makerspace for MIT students to use to explore amateur radio technology and other electronics projects. Maintains the W1XM UHF repeater and the W1XM contest station, including operating the building 54 radome.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53249",
    "name": "Ukraine@MIT",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2487497_Logo_TRANSPARENT_32694955.png",
    "website_url": "https://engage.mit.edu/UKR/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Ukraine@MIT is to band together the Ukrainians of MIT and those interested in Ukrainian culture and world events.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52885",
    "name": "Ultimate PickUp",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/alanmb/www/constitution.pdf",
    "categories": ["Athletics and Outdoors"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Ultimate Pickup is to organize casual ultimate frisbee games on campus for students, affiliates, and alumni to play together. This allows for more frisbee games than the spring IM season, and makes the sport more accessible to folks who do not have the time to play on the MIT club teams and IM teams.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52956",
    "name": "Undergraduate Economics Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/UEA/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT UEA optimizes the academic journey, employment prospects, and interconnectedness of MIT undergraduates within both the MIT community and the broader world.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53118",
    "name": "Undergraduate Mathematics Association",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/uma/www",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Undergraduate Mathematics Association is to afford all MIT undergraduates the opportunity to explore mathematics, to build connections with other students and faculty who share an interest in mathematics, and to promote mathematics in the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52887",
    "name": "Undergraduate Research Journal",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://murj.mit.edu/",
    "categories": ["Publication"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of MURJ is to serve as a vehicle for advancing scientific communication and responsible innovation by emphasizing the intersection of science and public policy. MURJ seeks to forge a network of readers, staff, and alumni to become the next generation of STEM leaders and provide a channel to inform the world of the impact of shared science.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52888",
    "name": "Undergraduate Research Technology Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2599876_2024_Logo_URTC__515125627.png",
    "website_url": "https://engage.mit.edu/URTC/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Bringing together undergraduates from around the world to present, discuss, and develop solutions to advance technology for humanity.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52889",
    "name": "Undergraduate Society for Women in Mathematics",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://uswim.mit.edu",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The organization aims to provide a supportive and inclusive community for woman-identifying and non-binary individuals within the MIT undergraduate math department and hosts events open to the MIT undergraduate community at large. Through regular community events and meetings, the organization will serve as a means for the aforementioned group of math students to foster relationships with one another and to share a love of mathematics. The organization will help its members to explore potential career paths and research trajectories via collaborations with various companies and research groups. Additionally, the organization will work to promote inclusivity within mathematics by organizing events and programs, both for the MIT and greater Boston community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53124",
    "name": "Undergraduate Women in Physics",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2509045_UWiP_Logo_51221452.png",
    "website_url": "http://web.mit.edu/uwip/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Undergraduate Women in Physics is to be a student-led group that supports MIT undergraduate students seeking a space to talk about the experiences of being a woman and/or being coded as a woman in physics, while acknowledging the diversity among people who have had these experiences. We sponsor community building events, share resources, and host women in STEM related events throughout the semester.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53183",
    "name": "Vedic Vision Forum",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2599229_cropped_VV_1124181215.png",
    "website_url": "https://engage.mit.edu/VVF/",
    "categories": ["Religious and Spiritual"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to foster holistic well-being and mindfulness among students by drawing from the timeless wisdom of spiritual philosophies. We aim to provide motivation, inspiration, and avenues for positive recreation, while encouraging personal growth through personality development and character building. Our organization is committed to guiding students away from self-destructive habits and addictions, and to nurturing principled, value-driven leaders with strong character and competence. We also seek to enrich the student experience by integrating arts, media, culture, and music into our educational initiatives.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52892",
    "name": "Video Game Orchestra",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2501948_logo_v3_largebackground_9718056.png",
    "website_url": "https://linktr.ee/mitvgo",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The MIT Video Game Orchestra is a student-led ensemble dedicated to playing original arrangements of video game music, film soundtracks, and all kinds of music not usually heard in concert halls. Made up of a mix of orchestral, band, and popular instruments, we play a wide variety of genres. All our arrangements are written by members of the orchestra and are tailored for the group, and we hold workshops to help members develop their arranging and orchestration skills. Outside of rehearsal, we have lots of fun too! :)We rehearse on Sundays 2-4pm in Kresge and/or the Student Center.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53231",
    "name": "Video Gamers Alliance",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2466712_cropped_31121012.png",
    "website_url": "https://vga.mit.edu",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "To bring all MIT Gaming related communities together and increase the opportunities for resources, engagement and outreach.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53014",
    "name": "Vietnamese Students",
    "logo_url": "https://engage.mit.edu/upload/mit/2022/s2_image_upload_2471539_150082238_1368796460150177_4782516238535173432_n_3292367.png",
    "website_url": "http://vsa.scripts.mit.edu/site/",
    "categories": ["Cultural"],
    "organization_type": "ASA Student Organization",
    "mission": "This group is to share Vietnamese cultures to MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53374",
    "name": "Voltage",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/volt/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Voltage (collectively, the organization) is to grow and develop the electrical engineering (EE) community at MIT. We seek to advance this mission by providing a community for MIT students interested in EE, fostering hands-on engineering experience, exposing them to industry trends within EE and providing them with career advice and growth opportunities. The cornerstones of the organization are community and mentorship.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52893",
    "name": "VR/AR at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://vratmit.com/",
    "categories": ["Technology"],
    "organization_type": "ASA Student Organization",
    "mission": "1. CREATING THE VR / AR COMMUNITY.We're like-minded students, excited about VR/AR/MR. We meet and organize events for our community throughout Boston and organize the biggest Reality Hackathon in the WORLD.2. PROVIDING RESOURCES TO DEVELOPERSWe empower and provide students necessary workshops and hardware to learn and build the next generation of Virtual and Augmented Reality.3. BRINGING INDUSTRY TO CAMPUSWe bridge academia and industry by connecting students and masters. We draw from the expertise from alumni and industry champions.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53071",
    "name": "Water Club",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://www.mitwater.org/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Water is the premier network for water research and innovation at MIT. Our mission is to bring together creative, passionate, and motivated individuals to explore ways by which research, innovation, and policy can help solve the most pressing challenges in the water sector.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53113",
    "name": "WHOI Student Organization",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2609090_Screenshot_20241022_094928_102295019.png",
    "website_url": "http://mit.whoi.edu/",
    "categories": ["Departmental Program"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the MIT/WHOI Student Organization is to encourage interaction between MIT students and the Woods Hole community, enhance student life, elevate student voices, and advocate on behalf of the student body of the Massachusetts Institute of Technology–Woods Hole Oceanographic Institution (MIT-WHOI) Joint Program. The MIT-WHOI Joint Program in Oceanography/Applied Ocean Science and Engineering is a joint venture between the two institutions to pursue excellence in oceanographic research and education. MIT students in this program are often based in Woods Hole, which is over 80 miles from Cambridge. Beyond creating a student community at WHOI, this group will help keep WHOI-based students in touch with each other and with those based at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52895",
    "name": "Women Business Leaders",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://wbl.mit.edu/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "MIT Women Business Leaders establishes a network of women undergraduates, faculty, alumnae and professionals to empower women in their business endeavors and support them in the development of their careers. We support our members in their personal and professional pursuits during and after their years at MIT.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52896",
    "name": "Women in Aerospace Engineering",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2515048_FullLogo_1030171423.png",
    "website_url": "https://www.facebook.com/MITWAE",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of Women in Aerospace Engineering (WAE) is to foster a community for gender minorities interested in aerospace engineering as well as encourage professional development and outreach through various social, industry, and local events.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52897",
    "name": "Women in Electrical Engineering and Computer Science",
    "logo_url": "https://engage.mit.edu/upload/mit/2024/s2_image_upload_2616772_wieecs_logo_bright_blue_41715258.png",
    "website_url": "http://womenineecs.com/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Our mission is to empower female and non-binary EECS students to succeed by fostering community, offering mentorship opportunities, and hosting professional development events.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53398",
    "name": "Women+ in Chemistry",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/WIC/",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "Women+ in Chemistry (WIC+) is a group that uses the lens of gender to guide its support of undergraduate students, graduate students and postdoctoral scholars in the Department of Chemistry. Our mission is to foster a sense of community in the department, facilitate connections with the greater community, support the professional development of department members, and advocate for people of all genders and for gender diversity in the department and the entire chemistry community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52998",
    "name": "Woop Garoo Magazine",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/voodoo/www/",
    "categories": ["Publication"],
    "organization_type": "ASA Student Organization",
    "mission": "To write jokes.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53358",
    "name": "Written Revolution",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "https://engage.mit.edu/writtenrev/",
    "categories": ["Publication"],
    "organization_type": "ASA Student Organization",
    "mission": "Written Revolution is an anti-imperialist club dedicated to fostering a deeper understanding and critical analysis of imperialism's impact on societies, cultures, and economies worldwide. Our purpose is to engage and educate a broad audience through the power of conversations, written work, and advocacy.At the heart of Written Revolution is the belief that knowledge and awareness are foundational to fostering empathy, promoting social justice, and driving meaningful change. We aim to create a safe, inclusive space where individuals from diverse backgrounds can come together to learn, share, and discuss the complex histories and ongoing effects of imperialism in an expressive manner.While our main purpose is a monthly publication, our activities include organizing reading groups, writing workshops, guest lectures, and discussion forums focused on anti-imperialist literature, historical texts, and contemporary analyses. Through these initiatives, we seek to highlight the voices and stories of those affected by imperialism, challenge prevailing narratives, and encourage critical thinking among our members.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "52899",
    "name": "Wuming Theater Club",
    "logo_url": "https://engage.mit.edu/upload/mit/2023/s2_image_upload_2505621_logojpg_1030172715.jpeg",
    "website_url": "http://wuming.scripts.mit.edu",
    "categories": ["Performance"],
    "organization_type": "ASA Student Organization",
    "mission": "The mission of Wuming is to promote expression of Chinese culture and language through the art of theater. We aim to provide important cultural and social bonding for participating diaspora Chinese students from diverse areas of the Sinophone world, and likewise to create a community among Chinese-speaking audience members while offering them satisfying theater-going experiences. Sharing Chinese culture with non-Chinese is also a part of the mission of Wuming. We include English subtitles in the shows to encourage an inclusive audience. By doing so, we enhance diversity in the MIT community.",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53063",
    "name": "Xapiens @ MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://Xapiens.club",
    "categories": ["Academic and Pre-Professional"],
    "organization_type": "ASA Student Organization",
    "mission": "To educate on and become involved in the advancement of radical technology which can lead to human enhancement",
    "membership_info": "Lifetime membership"
  },
  {
    "id": "53102",
    "name": "Yesplus at MIT",
    "logo_url": "https://engage.mit.edu/images/default_club_logo_square.png",
    "website_url": "http://web.mit.edu/yesplus/www/Home.html",
    "categories": ["Hobbies and Special Interests"],
    "organization_type": "ASA Student Organization",
    "mission": "The purpose of the Yesplus at MIT student group is to offer MIT students a lively and fun community to learn and practice meditation and other wellness activities. We organize yoga and meditation sessions.",
    "membership_info": "Lifetime membership"
  }
]
